[
    {
        "manuscript": "Ms-101,8r[4] (1914--0822) (NB)",
        "pt-number": "5·3062",
        "pt-page": "52[4]",
        "tlp-number": "5·473 (1)",
        "cross-references": "22.8.14 (1)  13.10.14 (1)",
        "date": "22.8.14.",
        "ger": "Die Logik muß für sich selber sorgen.",
        "eng": "Logic must take care of itself. [5.473 (1)]"
    },
    {
        "manuscript": "Ms-101,8r[5] et 9r[1] (1914--0822) (NB)",
        "pt-number": " 5·3063",
        "pt-page": "52[5]",
        "tlp-number": "5·473 (2-3)**",
        "cross-references": "22.8.14 (2)*  2.9.14 (1)**",
        "ger": "Wenn sich syntaktische Regeln für Funktionen überhaupt aufstellen / lassen, dann ist die ganze Theorie der Dinge, Eigenschaften etc. überflüssig. Es ist auch gar zu auffällig daß weder in den „Grundgesetzen” noch in den „Principia Mathematica” von dieser Theorie die Rede ist. Nochmals: denn die Logik muß für sich selbst sorgen. Ein mögliches Zeichen muß auch bezeichnen können. Alles was überhaupt möglich ist, ist auch legitim || erlaubt. Erinnern wir uns an die Erklärung warum „Sokrates ist Plato” unsinnig ist. Nämlich darum weil wir eine willkürliche Bestimmung nicht getroffen haben, aber nicht darum weil das Zeichen an und für sich etwa illegitim sei!",
        "eng": "If syntactic rules for functions can be set up at all, then the whole theory of things, properties etc. is superfluous. It is also very remarkable that neither Basic Laws nor Principia Mathematica speak of such a theory. Once again: because logic must take care of itself. A possible sign must be able to signify too. Whatever is possible at all is also legitimate (permissible). Let’s remember the explanation why “Socrates is identical” is nonsense. That is, because we have not set up an arbitrary convention, not because a sign is illegitimate in and of itself! [Cf. 5.473 (2-3).]"
    },
    {
        "manuscript": "Ms-101,12r[2] et 13r[1] (1914--0902) (NB)",
        "pt-number": "5·3063",
        "pt-page": "52[5]",
        "tlp-number": "5·473 (2-3)**",
        "cross-references": "22.8.14 (2)*  2.9.14 (1)**",
        "date": "2.9.14.",
        "ger": "Wir müssen in einem gewissen Sinne uns nicht in der Logik irren können. Dies ist schon teilweise / darin ausgedrückt: Die Logik muß für sich selbst sorgen. Dies ist eine ungemein tiefe & wichtige Erkenntnis.",
        "eng": "It must, in a certain sense be impossible for us to go wrong in logic. This is already partly expressed by saying: Logic must take care for itself. This is an extremely profound & important insight. [Cf. 5.473 (2-3).]"
    },
    {
        "manuscript": "Ms-101,13r[2] (1914--0902) (NB)",
        "pt-number": " 5·3064",
        "pt-page": "53[2]",
        "tlp-number": "5·4733 (1-2)*",
        "cross-references": "2.9.14 (2)",
        "ger": "Frege sagt: jeder rechtmäßig gebildete Satz muß einen Sinn haben und ich sage: jeder mögliche Satz ist rechtmäßig gebildet & wenn er keinen Sinn hat so kann das nur daran liegen daß wir einigen seiner Bestandteile keine Bedeutung gegeben haben. Wenn wir auch glauben es getan zu haben.",
        "eng": "Frege says: any well-formed sentence must make sense. And I say: any possible sentence is well-formed, and, if it doesn’t make sense, that can only be because we have not given any meaning to some of its constituents. Even if we think we have. [Cf. 5.4733 (1-2).]"
    },
    {
        "manuscript": "Ms-101,13r[3] et 14r[1] (1914--0903) (NB)",
        "pt-number": " 4·10227254",
        "pt-page": "35[6]",
        "tlp-number": "4·1274 (2)**",
        "cross-references": "3.9.14 (1)+",
        "date": "3.9.14.",
        "ger": "     Wie ist es mit der Aufgabe der Philosophie vereinbar daß die Logik für sich selbst sorgen soll? Wenn wir z.B. fragen: ist die & die Tatsache von der Subjekt-Prädikat Form / dann müssen wir doch wissen was wir unter der „Subjekt-Prädikat Form” verstehen. Wir müssen wissen ob es so eine Form überhaupt gibt. Wie können wir dies wissen? „Aus den Zeichen!” Aber wie? Wir haben ja gar keine Zeichen von dieser Form. Wir können zwar sagen: Wir haben Zeichen die sich so benehmen wie solche von der Subjekt-Prädikat Form, aber beweist das daß es wirklich Tatsachen dieser Form geben muß? Nämlich: wenn diese vollständig analysiert sind. Und hier frägt es sich wieder: gibt es so eine vollständige Analyse? Und wenn nicht: Was ist denn dann die Aufgabe der Philosophie?!!?",
        "eng": "How can the task of philosophy be reconciled with logic’s having to look after itself? For example, if we ask: Is such and such a fact of the subject-predicate form? / then we must know what we mean by the \"subject-predicate form\". We must know whether there is such a form at all. How can we know this? \"From the signs!\" But how? For we haven’t got any signs of this form. To be sure, we can say: We have signs that behave like those of the subject-predicate form, but does that prove that there really must be facts of this form? Namely: if those signs are completely analyzed. And here the question is again: Is there such a complete analysis? And if not: what is the task of philosophy then?!!? [Cf. 4.1274 (2)] (~NB)"
    },
    {
        "manuscript": "Ms-101,21r[2] (1914--0908) (NB)",
        "pt-number": " 5·30631",
        "pt-page": "53[1]",
        "tlp-number": "5·4731*",
        "cross-references": "8.9.14",
        "ger": "Das „Einleuchten” von dem Russell so viel sprach kann nur dadurch in der Logik entbehrlich werden daß die Sprache selbst jeden logischen Fehler verhindert. Und es ist klar daß jenes „Einleuchten” immer gänzlich trügerisch ist & war.",
        "eng": "There is only one way in which “self-evidence”, which Russell mentioned so often, can become dispensable in logic: language itself is to forestall every logical mistake. And it is clear that that “self-evidence” is and always was completely deceptive. [Cf. 5.4731]"
    },
    {
        "manuscript": "Ms-101,22r[1] (1914--0920) (NB)",
        "pt-number": " 4·01",
        "pt-page": "8[2]",
        "tlp-number": "4·01 (1)",
        "cross-references": "20.9.14 (1)+  27.9.14 (4)**  27.10.14 (7)**",
        "date": "20.9.14.",
        "ger": "Daß der Satz ein logisches Abbild seiner Bedeutung ist leuchtet dem unbefangenen Auge ein.",
        "eng": "That a sentence is a logical depiction of its meaning is obvious to the unbiased eye."
    },
    {
        "manuscript": "Ms-101,23r[4] (1914--0920) (NB)",
        "pt-number": " 5·41011",
        "pt-page": "94[3]",
        "tlp-number": "4·221 (2) ",
        "cross-references": "20.9.14 (8)**",
        "ger": "Es handelt sich in den obigen Fällen darum anzugeben wie Sätze in sich zusammenhängen. Wie der Satz-Verband zustande kommt.",
        "eng": "The point of the cases above is to say how propositions are connected internally.  How a propositional-compound comes about. [Cf. 4.221.]"
    },
    {
        "manuscript": "Ms-101,27r[2] (1914--0927) (NB)",
        "pt-number": " 4·071",
        "pt-page": "48[3]",
        "tlp-number": "4·03 (4)",
        "cross-references": "27.9.14 (1)**  3.10.14 (3)",
        "ger": "Ein Satz kann seinen Sinn ja nur dadurch ausdrücken daß er dessen logisches Abbild ist!",
        "eng": "A proposition can express its sense only by being its logical depiction."
    },
    {
        "manuscript": "Ms-101,28r[1] (1914--0929) (NB)",
        "pt-number": " 4·0711",
        "pt-page": "48[2]",
        "tlp-number": "4·031* (1)",
        "cross-references": "29.9.14 (2)**  15.10.14 (5)+",
        "ger": "Im Satz wird eine Welt probeweise zusammengestellt. (Wie wenn im Pariser Gerichtssaal ein Automobilunglück mit Puppen etc dargestellt wird.) ",
        "eng": " In a proposition an arrangement of a world is tried out. (As when in a Parisian courtroom a car accident is represented using dolls etc.). [Cf. 4.031 (1).]"
    },
    {
        "manuscript": "Ms-101,28r[3] (1914--0929) (NB)",
        "pt-number": "  4·0115",
        "pt-page": "26[7]",
        "tlp-number": "4·016 (1)**",
        "cross-references": "29.9.14 (4)+",
        "ger": "Denken wir an hieroglyphische Schriften bei denen jedes Wort seine Bedeutung darstellt! Denken wir daran daß auch wirkliche Bilder von Sachverhalten stimmen und nicht stimmen können.",
        "eng": "Let us think of hieroglyphic writing in which each word represents its meaning. Let us think also of the fact that real pictures of states of things can be right or wrong. [Cf 4.016 (1).]"
    },
    {
        "manuscript": "Ms-101,30r[5] (1914--1002) (NB)",
        "pt-number": " 4·0712",
        "pt-page": "48[4]",
        "tlp-number": "4·031 (2)*",
        "cross-references": "2.10.14 (2)",
        "ger": "Man kann geradezu sagen: statt „dieser Satz hat diesen & diesen Sinn”: „dieser Satz stellt diesen & diesen Sachverhalt dar!”",
        "eng": "Instead of \"this proposition has such and such a sense\" one can just say \"this proposition represents such and such a state of things”. [See 4.031 (2).]"
    },
    {
        "manuscript": "Ms-101,31r[2] (1914--1002) (NB)",
        "pt-number": " 4·09",
        "pt-page": "8[4]",
        "tlp-number": "4·06*",
        "cross-references": "2.10.14 (4)**",
        "ger": "Nur so kann der Satz wahr oder falsch sei: nur dadurch kann er mit der Wirklichkeit übereinstimmen oder nicht übereinstimmen daß er ein Bild eines Sachverhaltes ist.",
        "eng": "Only in this way can a proposition be true or false: it can only agree or disagree with reality by being a picture of a state of things. [See 4.06.]"
    },
    {
        "manuscript": "Ms-101,31r[3] (1914--1003) (NB)",
        "pt-number": " 4·072",
        "pt-page": "48[5]",
        "tlp-number": "4·032 (1)",
        "cross-references": "3.10.14 (1)",
        "date": "3.10.14.",
        "ger": "Nur in soweit ist der Satz ein Bild eines Sachverhalts als er logisch gegliedert ist! (Ein einfaches – ungegliedertes – Zeichen kann weder wahr noch falsch sein.)",
        "eng": "A proposition is a picture of a state of things only in so far as it is logically articulated. (A simple – non-articulated – sign can be neither true nor false). [See 4.032 (1).]"
    },
    {
        "manuscript": "Ms-101,31r[5] (1914--1003) (NB)",
        "pt-number": " 4·071",
        "pt-page": "48[3]",
        "tlp-number": "4·03 (4)",
        "cross-references": "27.9.14 (1)**  3.10.14 (3)",
        "ger": "Der Satz sagt nur insoweit etwas aus, als er ein Bild ist!",
        "eng": "A proposition states something only insofar as it is a picture! [See 4.03 (4).]"
    },
    {
        "manuscript": "Ms-101,31r[6] et 32r[1] (1914--1003) (NB)",
        "pt-number": "4·449",
        "pt-page": "45[6]",
        "tlp-number": "4·465**",
        "cross-references": "3.10.14 (4)  25.5.15 (4)",
        "ger": "Tautologien sagen nichts aus, sie sind nicht Bilder von Sachverhalten: Sie sind / selber logisch vollkommen neutral. (Das logische Produkt einer Tautologie und eines Satzes sagt nicht mehr noch weniger aus als dieser allein.)",
        "eng": " Tautologies state nothing, they are are not pictures of states of things. They are themselves logically completely neutral. (The logical product of a tautology and a propostion says neither more nor less than the latter by itself.) [See 4.462 and cf. 4.465.]"
    },
    {
        "manuscript": "Ms-101,31r[6] et 32r[1] (1914--1003) (NB)",
        "pt-number": "4·449",
        "pt-page": "45[6]",
        "tlp-number": "4·465**",
        "cross-references": "3.10.14 (4)  25.5.15 (4)",
        "ger": "Tautologien sagen nichts aus, sie sind nicht Bilder von Sachverhalten: Sie sind / selber logisch vollkommen neutral. (Das logische Produkt einer Tautologie und eines Satzes sagt nicht mehr noch weniger aus als dieser allein.)",
        "eng": " Tautologies state nothing, they are are not pictures of states of things. They are themselves logically completely neutral. (The logical product of a tautology and a propostion says neither more nor less than the latter by itself.) [See 4.462 and cf. 4.465.]"
    },
    {
        "manuscript": "Ms-101,34r[4] (1914--1007) (NB)",
        "pt-number": " 5·234",
        "pt-page": "36[1]",
        "tlp-number": "5·442**",
        "cross-references": " 7.10.14**",
        "date": "7.10.14.",
        "ger": "Wenn ein Satz φa gegeben ist so sind mit ihm auch schon alle seine logischen Funktionen (~φa etc.) mitgegeben!",
        "eng": "If a proposition φa is given, then at the same time all its logical functions (~φa, etc.) are given. [Cf. 5.442.]"
    },
    {
        "manuscript": "Ms-101,36r[5] (1914--1009) (NB)",
        "pt-number": "5·33412",
        "pt-page": "59[5]",
        "tlp-number": "5·535 (2)",
        "cross-references": "(9.10.14 (5)+)",
        "ger": "Alle Probleme die das „Axiom of Infinity“ mit sich bringt sind schon im Satze „(∃x) x = x” zu lösen!",
        "eng": "All the problems that come along with the \"Axiom of Infinity\" have already to be solved in the proposition \"(∃x) x = x\".  [Cf. 5.535 (2).]"
    },
    {
        "manuscript": "Ms-101,39r[4] (1914--1013) (NB)",
        "pt-number": " 5·3062",
        "pt-page": "52[4]",
        "tlp-number": "5·473 (1)",
        "cross-references": "22.8.14 (1)  13.10.14 (1)",
        "date": "13.10.14.",
        "ger": "Die Logik sorgt für sich selbst; wir müssen ihr nur zusehen wie sie es macht.",
        "eng": "Logic takes care of itself; all we have to do is to look and see how it does it. [Cf. 5 .473.]"
    },
    {
        "manuscript": "Ms-101,45r[2] (1914--1015) (NB)",
        "pt-number": "4·0711",
        "pt-page": "48[2]",
        "cross-references": "29.9.14 (2)**  15.10.14 (5)+",
        "tlp-number": "4·031 (1)",
        "ger": "Im Satze stellen wir – sozusagen – zur Probe die Dinge zusammen wie sie sich in Wirklichkeit aber nicht zu verhalten brauchen, wir können aber nicht etwas Unlogisches zusammenstellen denn dazu müßten wir in der Sprache aus der Logik heraus können. – Wenn aber der ganz allgemeine Satz nur „logische Konstante” enthält so kann er für uns nicht mehr sein als – einfach – ein logisches Gebilde und kann nicht mehr tun als uns seine eigenen logischen Eigenschaften zu zeigen. – Wenn es ganz allgemeine Sätze gibt, – was stellen wir in ihnen probeweise zusammen??",
        "eng": "In a proposition we – so to speak – try out putting things together as they do not have to be in reality; but we cannot make any unlogical arrangement, for in order to do that we would have to be able to get outside logic within language. – But if the entirely general proposition contains only \"logical constants\", then it cannot be anything more to us than – simply – a logical formation and cannot do anything more than show us its own logical properties. – If there are entirely general propositions – what do we try out in arranging them? [Cf 4.031 (1) and 3.03.]"
    },
    {
        "manuscript": "Ms-101,45r[2] (1914--1015) (NB)",
        "pt-number": "4·0711",
        "pt-page": "48[2]",
        "cross-references": "29.9.14 (2)**  15.10.14 (5)+",
        "tlp-number": "4·031 (1)",
        "ger": "Im Satze stellen wir – sozusagen – zur Probe die Dinge zusammen wie sie sich in Wirklichkeit aber nicht zu verhalten brauchen, wir können aber nicht etwas Unlogisches zusammenstellen denn dazu müßten wir in der Sprache aus der Logik heraus können. – Wenn aber der ganz allgemeine Satz nur „logische Konstante” enthält so kann er für uns nicht mehr sein als – einfach – ein logisches Gebilde und kann nicht mehr tun als uns seine eigenen logischen Eigenschaften zu zeigen. – Wenn es ganz allgemeine Sätze gibt, – was stellen wir in ihnen probeweise zusammen??",
        "eng": "In a proposition we – so to speak – try out putting things together as they do not have to be in reality; but we cannot make any unlogical arrangement, for in order to do that we would have to be able to get outside logic within language. – But if the entirely general proposition contains only \"logical constants\", then it cannot be anything more to us than – simply – a logical formation and cannot do anything more than show us its own logical properties. – If there are entirely general propositions – what do we try out in arranging them? [Cf 4.031 (1) and 3.03.]"
    },
    {
        "manuscript": "Ms-101,46r[2] (1914--1015) (NB)",
        "pt-number": " 2·1516",
        "pt-page": "14[10]",
        "tlp-number": "2·1515",
        "cross-references": "15.10.14 (7)**",
        "ger": "Ich habe hier die Beziehungen der Satz-Elemente zu ihren Bedeutungen gleichsam als Fühler betrachtet durch welche der Satz mit der Außenwelt in Berührung steht; und das Verallgemeinern eines Satzes gleicht dann dem Einziehen der Fühler; bis endlich der ganz allgemeine Satz ganz isoliert ist. Aber stimmt dieses Bild? (Ziehe ich wirklich einen Fühler ein wenn ich statt φ(a), (∃x).φ(x) sage?)",
        "eng": "Here I have regarded the relations of the proposition’s elements to their meanings as antennae, so to speak, by means of which a proposition is in contact with the outer world. The generalization of a proposition then resembles the retraction of antennae, until finally an entirely general proposition is completely isolated. But is this picture correct? (Do I really retract an antenna if I say (∃x).φ(x) instead of φ(a)?) [Cf 2.1515.]"
    },
    {
        "manuscript": "Ms-101,48r[2] (1914--1017) (NB)",
        "pt-number": " 5·324",
        "pt-page": "            63[1]",
        "tlp-number": "5·526 (2)*",
        "cross-references": "17.10.14 (3)*",
        "ger": "Kann man denn aber nicht die ganze Welt vollständig mit ganz allgemeinen Sätzen beschreiben? (Das Problem zeigt sich von allen Seiten.) Ja, man könnte die Welt vollständig durch ganz allgemeine Sätze beschreiben also ganz ohne irgend einen Namen oder sonst ein bezeichnendes Zeichen zu verwenden. Und um auf die gewöhnliche Sprache zu kommen brauchte man Namen etc. nur dadurch einführen indem man nach einem „(∃x)” sagte „und dieses x ist A” u.s.w.",
        "eng": "But can't one describe the whole world completely by means of entirely general propositions? (The problem shows up on all sides.) Yes, one could describe the world completely by entirely general propositions, and hence wholly without using any kind of name or any other referring sign. And in order to arrive at ordinary language one would only need to introduce names etc. by saying after an \"(∃x)\", \"and that x is A\" and so on. [Cf. 5.526.]"
    },
    {
        "manuscript": "Ms-101,48r[2] (1914--1017) (NB)",
        "pt-number": " 5·324",
        "pt-page": "            63[1]",
        "tlp-number": "5·526 (2)*",
        "cross-references": "17.10.14 (3)*",
        "ger": "Kann man denn aber nicht die ganze Welt vollständig mit ganz allgemeinen Sätzen beschreiben? (Das Problem zeigt sich von allen Seiten.) Ja, man könnte die Welt vollständig durch ganz allgemeine Sätze beschreiben also ganz ohne irgend einen Namen oder sonst ein bezeichnendes Zeichen zu verwenden. Und um auf die gewöhnliche Sprache zu kommen brauchte man Namen etc. nur dadurch einführen indem man nach einem „(∃x)” sagte „und dieses x ist A” u.s.w.",
        "eng": "But can't one describe the whole world completely by means of entirely general propositions? (The problem shows up on all sides.) Yes, one could describe the world completely by entirely general propositions, and hence wholly without using any kind of name or any other referring sign. And in order to arrive at ordinary language one would only need to introduce names etc. by saying after an \"(∃x)\", \"and that x is A\" and so on. [Cf. 5.526.]"
    },
    {
        "manuscript": "Ms-101,51r[4] (1914--1019) (NB)",
        "pt-number": " 5·323",
        "pt-page": "62[4]",
        "tlp-number": "5·526 (1)",
        "cross-references": "17.10.14 (3)* 19.10.14 (3)**   31.5.15 (1,4)+",
        "ger": "Es leuchtet ein daß man den Bau der Welt ohne irgend welche Namen zu nennen beschreiben können muß. ",
        "eng": "It is obvious that we must be able to describe the construction of the world without mentioning any names. [Cf. 5.526 (1).]"
    },
    {
        "manuscript": "Ms-101,52r[2] (1914--1020) (NB)",
        "pt-number": " 2·18 ",
        "pt-page": "6[3]",
        "tlp-number": "2·18**",
        "cross-references": "20.10.14 (2,4)**",
        "ger": "Die Form eines Bildes könnte man dasjenige nennen worin das Bild mit der Wirklichkeit stimmen muß (um sie überhaupt abbilden zu können).",
        "eng": "The form of a picture might be called that in which the picture must agree with reality (in order to be able to depict it in any way at all). [Cf. 2.17 and 2.18.]"
    },
    {
        "manuscript": "Ms-101,52r[4] et 53r[1] (1914--1020) (NB)",
        "pt-number": " 2·18 ",
        "pt-page": "6[3]",
        "tlp-number": "2·18**",
        "cross-references": "20.10.14 (2,4)**",
        "ger": "Die Theorie der logischen Abbildung durch die / Sprache sagt – ganz allgemein: Damit es möglich ist daß ein Satz wahr oder falsch sei – daß er mit der Wirklichkeit übereinstimme oder nicht – dazu muß im Satze etwas mit der Wirklichkeit identisch sein.",
        "eng": "The theory of logical depiction by means of language says - entirely generally: In order for it to be possible for a proposition to be true or false - agree reality or not - something in the proposition must be identical with reality. [Cf. 2.18.]"
    },
    {
        "manuscript": "Ms-101,53r[2] (1914--1020) (NB)",
        "pt-number": " 5·313",
        "pt-page": "61[7]",
        "tlp-number": "5·512 (2-3)*",
        "cross-references": "20.10.14 (5)*",
        "ger": "Das was in „~p” verneint ist nicht das „~” vor dem „p” sondern dasjenige was allen Zeichen die in dieser Notation mit „~p” gleichbedeutend sind gemeinsam ist; also das Gemeinsame von ",
        "eng": "What negates in \"~p\" is not the \"~\" in front of the \"p\", rather it is done by what all signs that have the same meaning as \"~p\" in this notation have in common; and so the common factor in\t\t "
    },
    {
        "manuscript": "Ms-101,54r[2] (1914--1020) (NB)",
        "pt-number": " 4·02322",
        "pt-page": "47[8]",
        "tlp-number": "4·023 (5)**",
        "cross-references": "20.10.14 (8)",
        "ger": "Der Satz konstruiert eine Welt mit Hilfe seines logischen Gerüstes und darum kann man am Satz auch sehen wie sich alles Logische verhielte wenn er wahr wäre: man kann aus einem falschen Satz Schlüsse ziehen etc. So kann ich sehen daß, wenn „(x,φ). φ(x)” wahr wäre, dieser Satz im Widerspruch stünde mit einem Satze „ψ(a)”.)",
        "eng": "Propositions construct a world with the help of their logical scaffolding, which is why one can actually see from propositions how all logical matters would stand, if they are true: one can draw inferences from a false proposition, etc. (In this way I can see that if \"(x,φ). φ(x)\" were true, this proposition would contradict a proposition \"ψ(a)\"). [Cf. 4.023.]"
    },
    {
        "manuscript": "Ms-101,56r[4] et 57r[1] et 58r[1] (1914--1022) (NB)",
        "pt-number": " 3·23",
        "pt-page": "24[10]",
        "tlp-number": "3·34 (2)*",
        "cross-references": "22.10.14 (1)+ ",
        "date": "22.10.14.",
        "ger": "Im Satz muß etwas mit seiner / Bedeutung identisch sein, der Satz darf aber nicht mit seiner Bedeutung identisch sein, also muß etwas in ihm mit seiner Bedeutung nicht identisch sein. (Der Satz ist ein Gebilde mit den logischen Zügen des Dargestellten und mit noch anderen Zügen, diese nun werden willkürlich sein und in verschiedenen Zeichensprachen verschieden.) Es muß also verschiedene Gebilde mit denselben logischen Zügen geben; das Dargestellte wird eines von diesen sein und es wird sich bei der Darstellung darum handeln dieses von anderen Gebilden mit denselben logischen Zügen zu unterscheiden (da ja sonst die Darstellung nicht eindeutig wäre). Dieser Teil der Darstellung (die Namengebung) muß nun durch willkürliche Bestimmungen geschehen. Es muß darnach also jeder Satz Züge mit willkürlich bestimmten / Bedeutungen enthalten.",
        "eng": "In a proposition something must be identical with its meaning, but a proposition cannot be identical with its meaning, and so something in it must not be identical with its meaning. (A proposition is a formation with the logical features of what it represents and with other features as well, which will be arbitrary and different in different sign-languages). So there must be different formations with the same logical features; what is represented will be one of them, and the representation will need to distinguish it from other formations with the same logical features. (Since otherwise the representation would be ambiguous). Now this part of the representation (the naming) must happen by means of arbitrary assignations. Thus, every proposition must contain features with arbitrarily assigned meanings. [Cf. 3.34 (2).]"
    },
    {
        "manuscript": "Ms-101,59r[4] (1914--1023) (NB)",
        "pt-number": " 3·252",
        "pt-page": "55[2]",
        "tlp-number": "3·326**",
        "cross-references": "23.10.14 (6)**",
        "ger": "Um das Zeichen im Zeichen zu erkennen muß man auf den Gebrauch achten.",
        "eng": "To recognize the sign in the sign one must pay attention to its use. [Cf. 3.326.]"
    },
    {
        "manuscript": "Ms-101,59r[5] et 60r[1] (1914--1023) (NB)",
        "pt-number": " 4·0742",
        "pt-page": "76[5]",
        "tlp-number": "4·0411* ",
        "cross-references": "23.10.14 (7,8,9,10)*",
        "ger": "Wollten wir es durch Einfüllen einer Marke in die leeren Argumentstellen versuchen etwa so „(A,A).ψ(A,A)” es würde nicht genügen (wir könnten die Identität der Variablen nicht feststellen). Alle diese Bezeichnungsweisen genügen nicht weil sie nicht die notwendigen logischen Eigenschaften haben. Alle jene Zeichenverbindungen vermögen den gewünschten Sinn – auf die vorgeschlagene Weise – nicht abzubilden.",
        "eng": "If we tried to do it by inserting a mark into the empty argument places  – such as \"(A,A).ψ(A,A)\" – it would not suffice (we could not ascertain the identity of the variables). All these modes of signifying are insufficient because they do not have the necessary logical properties. All those combinations of signs are incapable of depicting the requisite sense - in the proposed way. [Cf. 4. 0411.]"
    },
    {
        "manuscript": "Ms-101,64r[2] (1914--1026) (NB)",
        "pt-number": " 2·221 ",
        "pt-page": "6[9]",
        "tlp-number": "2·221",
        "cross-references": "26.10.14 (3)+",
        "ger": "Der Sinn des Satzes ist das was er vorstellt.",
        "eng": "The sense of a proposition is what it betokens. [Cf. 2.221.]"
    },
    {
        "manuscript": "Ms-101,65r[5] (1914--1027) (NB)",
        "pt-number": "2·12",
        "pt-page": "4[5]",
        "tlp-number": "4·01 (1)",
        "cross-references": "(27.10.14 (7)+)",
        "ger": "/ \\ \\ \\ ✓ \tDer Satz ist ein Modell der Wirklichkeit so wie wir sie uns denken.",
        "eng": "A proposition is a model of reality as we conceive of it. [See 4.01 (2).]"
    },
    {
        "manuscript": "Ms-101,65r[5] (1914--1027) (NB)",
        "pt-number": "2·12",
        "pt-page": "4[5]",
        "tlp-number": "4·01 (1)",
        "cross-references": "(27.10.14 (7)+)",
        "ger": "/ \\ \\ \\ ✓ \tDer Satz ist ein Modell der Wirklichkeit so wie wir sie uns denken.",
        "eng": "A proposition is a model of reality as we conceive of it. [See 4.01 (2).]"
    },
    {
        "manuscript": "Ms-101,66r[2] (1914--1028) (NB)",
        "pt-number": " 5·326",
        "pt-page": "63[4]",
        "tlp-number": "5·5262**",
        "cross-references": "28.10.14 (2,3)* 29.10.14 (1)",
        "ger": "Schließlich verändert ja die Wahr- oder Falschheit jedes Satzes etwas an der allgemeinen Struktur der Welt. Und der Spielraum der ihre Struktur durch die Gesamtheit aller Elementarsätze gelassen wird ist eben derjenige welchen die ganz allgemeinen Sätze begrenzen.",
        "eng": "After all, the truth or falsehood of every proposition changes something about the general structure of the world. And the leeway that is left to its structure by the totality of all elementary propositions is precisely what is delimited by entirely general propositions. [Cf. 5.5262.]"
    },
    {
        "manuscript": "Ms-101,66r[3] et 67r[1] (1914--1029) (NB)",
        "pt-number": " 5·326",
        "pt-page": "63[4]",
        "tlp-number": "5·5262**",
        "cross-references": "28.10.14 (2,3)* 29.10.14 (1)",
        "date": "29.10.14.",
        "ger": "Denn, wenn ein Elementarsatz wahr ist so ist doch jedenfalls / ein Elementarsatz mehr, wahr, u. u.",
        "eng": "For, if an elementary proposition is true, then, at any rate, yet another elementary proposition is true, and conversely. [See 5.5262.]"
    },
    {
        "manuscript": "Ms-101,67r[3] (1914--1029) (NB)",
        "pt-number": " 4·101",
        "pt-page": "16[13]",
        "tlp-number": "4·12 (1)*",
        "cross-references": "29.10.14 (4)+",
        "ger": "Die logische Form des Sachverhaltes aber, läßt sich nicht beschreiben. –",
        "eng": "The logical form of a state of things, however, cannot be described. - – [Cf. 4.12 and 4.121.]"
    },
    {
        "manuscript": "Ms-101,69r[6] et 70r[1] (1914--1030) (NB)",
        "pt-number": " 4·0231",
        "pt-page": "47[5]",
        "tlp-number": "4·023 (1-2)*",
        "cross-references": "30.10.14 (3)  31.10.14 (3)*  (14.2.15 (2)+)",
        "ger": "Wenn wir aber diese Darstellungsmethoden einräumen, was ist dann eigentlich charakteristisch für die / Beziehung des Darstellens?",
        "eng": "If, however, we admit these methods of representation, then what is really characteristic of the relation of representing?"
    },
    {
        "manuscript": "Ms-102,1r[3] (1914--1030) (NB)",
        "pt-number": "5·30222",
        "pt-page": "49[6]",
        "tlp-number": "5·454 (1)",
        "cross-references": "30.10.14 (10)",
        "ger": "In der Logik gibt es kein Nebeneinander, kann es keine Klassifikation geben! ",
        "eng": "In logic there are no neighbours, nor can there be any classification. [See 5.454.]"
    },
    {
        "manuscript": "Ms-102,1r[4] et 2r[1] (1914--1031) (NB)",
        "pt-number": " 5·325",
        "pt-page": "63[2]",
        "tlp-number": "5·5261 (1)*",
        "cross-references": "31.10.14 (1)*",
        "ger": "Ein Satz wie „(∃x,φ).φx” ist gerade so gut zusammengesetzt wie ein elementarer; / dies zeigt sich darin daß wir in der Klammer „φ” & „x” extra erwähnen müssen. Beide stehen – unabhängig – in bezeichnenden Beziehungen zur Welt, gerade wie im Falle eines Elementarsatzes „ψ(a)”.",
        "eng": "A proposition like \"(∃x,φ).φx\" is just as composite as an elementary one. This shows itself in our needing to mention \"φ\" & \"x\" explicitly in the brackets. Both symbols independently stand in signifying relations to the world, just as in the case of an elementary proposition \"ψ(a)\". [Cf 5.5261.]"
    },
    {
        "manuscript": "Ms-102,2r[3] (1914--1031) (NB)",
        "pt-number": " 4·0231",
        "pt-page": "47[5]",
        "tlp-number": "4·023 (1-2)*",
        "cross-references": "30.10.14 (3)  31.10.14 (3)*  (14.2.15 (2)+)",
        "ger": "Die Bedeutung des Satzes muß durch ihn und seine Darstellungsweise auf ja oder nein fixiert sein. Dazu muß sie durch ihn vollständig beschrieben sein. ",
        "eng": "The meaning of a proposition must be fixed in terms of yes or no by means of it and its way of representing. To achieve this, the meaning must be completely described by the proposition. [Cf 4.023.]"
    },
    {
        "manuscript": "Ms-102,4r[4] (1914--1101) (NB)",
        "pt-number": " 5·3221",
        "pt-page": "76[4]",
        "tlp-number": "5·525 (3) ",
        "cross-references": "1.11.14 (5)",
        "ger": "Jener Präzedenzfall auf den man sich immer berufen möchte muß schon im Zeichen selber liegen. ",
        "eng": "That precedent to which one would always like to appeal must reside in the sign itself. [Cf. 5.525 (3).]"
    },
    {
        "manuscript": "Ms-102,7r[2] (1914--1101) (NB)",
        "pt-number": " 4·092",
        "pt-page": "28[5]",
        "tlp-number": " 4·062*",
        "cross-references": "1.11.14 (14)+",
        "ger": "Daß zwei Leute nicht kämpfen kann man darstellen indem man sie nicht-kämpfend darstellt und auch so indem man sie kämpfend darstellt und sagt das Bild zeige wie es sich nicht verhält. Man könnte mit negativen Tatsachen ebensogut darstellen wie mit positiven –. Wir aber wollen bloß die Prinzipe der Darstellung überhaupt untersuchen. ",
        "eng": "That two people aren't fighting can be represented by representing them as not fighting and also by representing them fighting and saying the picture shows how things are not. One could represent by using negative facts just as easily as with positive ones. – However, all we want is to examine the principles of representation as such.  [Cf. 4.062.]"
    },
    {
        "manuscript": "Ms-102,7r[3] et 8r[1] (1914--1101) (NB)",
        "pt-number": " 6·004",
        "pt-page": "74[6]",
        "tlp-number": "5·542**",
        "cross-references": "AüL 191 (4)+   MN 223 (3)+   1.11.14 (15)+",
        "ger": "Der Satz „‘p’ ist wahr” ist gleichbedeutend mit dem logischen Produkt von ‚p’ und einem Satz „‘p’” der den Satz ‚p’ beschreibt und einer Zuordnung der Bestandteile der beiden  / Sätze. – Die internen Beziehungen von Satz & Bedeutung werden durch die internen Beziehungen zwischen ‚p’ und „‘p’” abgebildet. (Schlechte Bemerkung) ",
        "eng": "The proposition \"'p' is true\" has the same meaning as the logical product of 'p' and a proposition \"'p'\" describing the proposition 'p', and a correlation of the constituents of the two propositions. - The internal relations between proposition and meaning are depicted by the internal relations between 'p' and \"'p'\". (Bad remark)  "
    },
    {
        "manuscript": "Ms-102,8r[3] (1914--1101) (NB)",
        "pt-number": "3·001",
        "pt-page": "42[6]",
        "tlp-number": "3·001**",
        "cross-references": "1.11.14 (17)",
        "ger": " „Ein Sachverhalt ist denkbar” („vorstellbar”) heißt: Wir können uns ein Bild von ihm machen. ",
        "eng": "“A state of things is thinkable” (“imaginable”) means: we can make ourselves a picture of it. [See 3.001.]"
    },
    {
        "manuscript": "Ms-102,8r[4] et 9r[1] (1914--1101) (NB)",
        "pt-number": "3·2101",
        "pt-page": "43[3]",
        "tlp-number": "3·4",
        "cross-references": "1.11.14 (18, 19)*",
        "ger": "Wenn auch kein Komplex in dem logischen Ort ist so ist doch Einer: nicht in dem logischen Ort. ",
        "eng": "Even if there is no complex in the logical locus, there still is one, but not in that logical locus. [Cf. 3.4.]"
    },
    {
        "manuscript": "Ms-102,9r[2] (1914--1102) (NB)",
        "pt-number": " 4·4483",
        "pt-page": "44[7]",
        "tlp-number": "4·462 (2)",
        "cross-references": "2.11.14 (1)*  MN 223 (3)**",
        "date": "2.11.14.",
        "ger": "In der Tautologie heben die Bedingungen der Übereinstimmung mit der Welt (die Wahrheitsbedingungen) – die darstellenden Beziehungen – einander auf so daß sie in keiner darstellenden Beziehung zur Wirklichkeit steht (nichts sagt).",
        "eng": "In a tautology, the conditions of agreement with the world (the truth conditions) - the representing relations - cancel one another out, so that it does not stand in any representing relation to reality (says nothing). [Cf. 4.462.]"
    },
    {
        "manuscript": "Ms-102,12r[2] (1914--1103) (NB)",
        "pt-number": "4·01121",
        "pt-page": "56[2]",
        "tlp-number": "4·012 a*",
        "cross-references": "3.11.14 (5)+",
        "ger": "Offenbar daß wir den Elementarsatz als das Bild eines Sachverhalts empfinden –, wie geht das zu? ",
        "eng": "It is evident that an elementary proposition strikes us as a picture of a state of things. -- How does that go? [Cf. 4.012.]"
    },
    {
        "manuscript": "Ms-102,14r[3] et 15r[1] (1914--1103) (NB)",
        "pt-number": " 5·322",
        "pt-page": "63[5]",
        "tlp-number": "3.11.14 (12)** 2.12.16 (1)+  (Pilch: PT 5·3221)",
        "cross-references": "3.11.14 (12)** 2.12.16 (1)+  (Pilch: PT 5·3221)",
        "ger": "Jene willkürliche Zuordnung von Zeichen & Bezeichnetem die die Möglichkeit der Sätze bedingt und die ich in den ganz allgemeinen Sätzen vermißte geschieht dort durch die Allgemeinheitsbezeichnung geradeso wie beim Elementarsatz durch Namen (denn die Allgemeinheitsbezeichnung gehört nicht zum Bild). Daher empfand man  / auch immer daß die Allgemeinheit ganz wie ein Argument auftritt. ",
        "eng": "That arbitrary correlation of a sign and what it signifies which is a condition of the possibility of the propositions, and which I found lacking in wholly general propositions, occurs there by means of the sign for generality just as in the elementary proposition it occurs by means of names. (For the sign for generality does not belong to the picture). Hence, the constant feeling that generality figures just like an argument. [Cf. 5.523.]"
    },
    {
        "manuscript": "Ms-102,15r[2] (1914--1103) (NB)",
        "pt-number": " 4·095",
        "pt-page": "45[9]",
        "tlp-number": "4·064*",
        "cross-references": "3.11.14 (15)+",
        "ger": "Verneinen kann man nur einen fertigen Satz. (Ähnliches gilt von allen ab-Funktionen.) ",
        "eng": "Only a finished proposition can be negated. (Likewise for all ab-functions). [Cf. 4.064 and 4.0641.]"
    },
    {
        "manuscript": "Ms-102,15r[4] (1914--1103) (NB)",
        "pt-number": " 4·095",
        "pt-page": "45[9]",
        "tlp-number": "4·064*",
        "cross-references": "3.11.14 (15)+",
        "ger": "Die Verneinung bezieht sich auf den fertigen Sinn des verneinten Satzes und nicht auf dessen Darstellungsweise. ",
        "eng": "Negation alludes to the finished sense of the negated proposition, and not to its way of presenting. [Cf. 4.064 and 4.0641.]"
    },
    {
        "manuscript": "Ms-102,16r[3] (1914--1103) (NB)",
        "pt-number": "4·0952",
        "pt-page": "40[5]",
        "tlp-number": "4·0641 (3)*",
        "cross-references": "3.11.14 (18, 20, 22)",
        "ger": "Man könnte sagen: die Verneinung bezieht sich schon auf den logischen Ort den der verneinte Satz bestimmt. ",
        "eng": "One could say: the negation already alludes to the logical locus traced out by the negated proposition. [See 4.0641 (3).]"
    },
    {
        "manuscript": "Ms-102,16r[5] (1914--1103) (NB)",
        "pt-number": "4·0952",
        "pt-page": "40[5]",
        "tlp-number": "4·0641 (3)*",
        "cross-references": "3.11.14 (18, 20, 22)",
        "ger": "Der verneinende Satz bestimmt einen anderen logischen Ort als der verneinte. ",
        "eng": "The negating proposition traces out a different logical locus from the negated proposition. [See 4.0641 (3).]"
    },
    {
        "manuscript": "Ms-102,17r[2] (1914--1103) (NB)",
        "pt-number": " 4·0952",
        "pt-page": "40[5]",
        "tlp-number": "4·0641 (3)*",
        "cross-references": "3.11.14 (18, 20, 22)",
        "ger": "Der verneinende Satz bestimmt seinen logischen Ort mit Hilfe des logischen Ortes des verneinten Satzes. Indem er jenen als den außerhalb diesem liegenden beschreibt. ",
        "eng": "The negating proposition traces out its logical locus using the logical locus of the negated proposition by describing it as lying outside the latter. [See 4.0641 (3).]"
    },
    {
        "manuscript": "Ms-102,20r[4] et 21r[1] (1914--1105) (NB)",
        "pt-number": "5·3031 SchonEnth. 51[6]",
        "pt-page": "5·3031 SchonEnth. 51[6]",
        "tlp-number": "5·47 (2)*",
        "cross-references": "5.11.14 (6)**  12.11.14 (5)+",
        "ger": "Denn wenn die positive Tatsache φa gegeben ist dann ist auch die Möglichkeit für (x).φx, ~(∃x).φx, ~φ(a) etc. etc. gegeben. (Alle / logischen Konstanten sind bereits im Elementarsatz enthalten.) ",
        "eng": "For if a positive fact φa is given then so is the possibility of (x).φx, ~(∃x).φx, ~φ(a) etc. etc. (An elementary proposition already contains all logical constants.) [Cf. 5.47 (2).]"
    },
    {
        "manuscript": "Ms-102,20r[4] et 21r[1] (1914--1105) (NB)",
        "pt-number": "5·3031 SchonEnth. 51[6]",
        "pt-page": "5·3031 SchonEnth. 51[6]",
        "tlp-number": "5·47 (2)*",
        "cross-references": "5.11.14 (6)**  12.11.14 (5)+",
        "ger": "Denn wenn die positive Tatsache φa gegeben ist dann ist auch die Möglichkeit für (x).φx, ~(∃x).φx, ~φ(a) etc. etc. gegeben. (Alle / logischen Konstanten sind bereits im Elementarsatz enthalten.) ",
        "eng": "For if a positive fact φa is given then so is the possibility of (x).φx, ~(∃x).φx, ~φ(a) etc. etc. (An elementary proposition already contains all logical constants.) [Cf. 5.47 (2).]"
    },
    {
        "manuscript": "Ms-102,20r[4] et 21r[1] (1914--1105) (NB)",
        "pt-number": "5·3031 SchonEnth. 51[6]",
        "pt-page": "5·3031 SchonEnth. 51[6]",
        "tlp-number": "5·47 (2)*",
        "cross-references": "5.11.14 (6)**  12.11.14 (5)+",
        "ger": "Denn wenn die positive Tatsache φa gegeben ist dann ist auch die Möglichkeit für (x).φx, ~(∃x).φx, ~φ(a) etc. etc. gegeben. (Alle / logischen Konstanten sind bereits im Elementarsatz enthalten.) ",
        "eng": "For if a positive fact φa is given then so is the possibility of (x).φx, ~(∃x).φx, ~φ(a) etc. etc. (An elementary proposition already contains all logical constants.) [Cf. 5.47 (2).]"
    },
    {
        "manuscript": "Ms-102,21r[5] et 22r[1] (1914--1106) (NB)",
        "pt-number": " 4·0953",
        "pt-page": "41[1]",
        "tlp-number": "4·0641 (4)**",
        "cross-references": "6.11.14 (2)",
        "ger": "Daß man den verneinten Satz wieder  / verneinen kann zeigt, daß das was verneint wird schon ein Satz und nicht erst die Vorbereitung zu einem Satz ist. ",
        "eng": "That the negated proposition can be negated once more shows that what is negated is already a proposition, and not just something preliminary to a proposition. [See 4.0641 (4).]"
    },
    {
        "manuscript": "Ms-102,22r[4] (1914--1107) (NB)",
        "pt-number": " 3·2103",
        "pt-page": "43[5]",
        "tlp-number": "3·411",
        "cross-references": "7.11.14",
        "date": "7.11.14.",
        "ger": "Der räumliche & der logische Ort stimmen darin überein daß beide die Möglichkeit einer Existenz sind. ",
        "eng": "A spatial and a logical locus agree to this extent: that each is the source of something’s existence. [3.411.]"
    },
    {
        "manuscript": "Ms-102,23r[1] (1914--1108) (NB)",
        "pt-number": " 5·0934",
        "pt-page": "78[8]",
        "cross-references": "8.11.14 (1)**",
        "date": "8.11.14.",
        "ger": "Was sich in den Sätzen über Wahrscheinlichkeit durch das Experiment bestätigen läßt kann unmöglich Mathematik sein! ",
        "eng": "What can be confirmed by experiment, in propositions about probability, cannot possibly be mathematics. [Cf. 5.154 (1-2).]"
    },
    {
        "manuscript": "Ms-102,23r[1] (1914--1108) (NB)",
        "pt-number": " 5·0934",
        "pt-page": "78[8]",
        "cross-references": "8.11.14 (1)**",
        "date": "8.11.14.",
        "ger": "Was sich in den Sätzen über Wahrscheinlichkeit durch das Experiment bestätigen läßt kann unmöglich Mathematik sein! ",
        "eng": "What can be confirmed by experiment, in propositions about probability, cannot possibly be mathematics. [Cf. 5.154 (1-2).]"
    },
    {
        "manuscript": "Ms-102,23r[2] (1914--1108) (NB)",
        "pt-number": " 5·0933",
        "pt-page": "78[7]",
        "tlp-number": "5·156 (5)** ",
        "cross-references": "8.11.14 (2) +",
        "ger": "Wahrscheinlichkeitssätze sind Auszüge naturwissenschaftlicher Gesetze. "
    },
    {
        "manuscript": "Ms-102,23r[3] (1914--1108) (NB)",
        "pt-number": " 5·092",
        "pt-page": "78[3]",
        "tlp-number": "5·156 (1) ",
        "cross-references": "8.11.14 (3)+",
        "ger": "Sie sind Verallgemeinerungen und drücken eine unvollständige Kenntnis jener Gesetze aus. ",
        "eng": "They are generalizations and express an incomplete knowledge of those laws. [Cf. 5.156 (1).]"
    },
    {
        "manuscript": "Ms-102,23r[4] et 24r[1] (1914--1108) (NB)",
        "pt-number": " +5·154",
        "pt-page": "107[1]",
        "tlp-number": "5·154",
        "cross-references": "8.11.14 (4)+",
        "ger": "Wenn ich z.B. schwarze & weiße Ballen aus einer Urne ziehe so kann ich nicht vor einem Zug sagen ob ich einen weißen oder schwarzen Ballen ziehen werde da ich hierzu die Naturgesetze nicht genau genug kenne aber  / das weiß ich doch daß im Falle gleich viel schwarze & weiße Ballen vorhanden sind die Zahlen der gezogenen schwarzen sich der der weißen bei fortgesetztem Ziehen nähern wird, so genau kenne ich die Naturgesetze eben doch. ",
        "eng": "For example, if I draw black and white balls from an urn, I cannot say before taking one out whether I will draw a white or a black ball because I do not know the laws of nature well enough, but surely I do know that in the case of equal numbers of black & white balls, the number of black balls drawn will approach the numbers of white balls drawn as the drawing continues; I do know the laws of nature well enough for that. [Cf. 5.154.]"
    },
    {
        "manuscript": "Ms-102,24r[2] (1914--1109) (NB)",
        "pt-number": "5·0931",
        "pt-page": "78[5]",
        "tlp-number": "5·156 (3)* ",
        "cross-references": "9.11.14 (1)+",
        "date": "9.11.14.",
        "ger": "Was ich nun in den Wahrscheinlichkeitssätzen kenne, sind gewisse allgemeine Eigenschaften der unverallgemeinerten naturwissenschaftlichen Sätze wie z.B. ihre Symmetrie in gewissen Beziehungen ihre Asymmetrie in anderen etc. ",
        "eng": "Now what I know now in probability statements are certain general properties of ungeneralized scientific propositions such as, for example, their symmetry in certain respects, their asymmetry in others, etc. [Cf. 5.156 (3).]"
    },
    {
        "manuscript": "Ms-102,24r[3] (1914--1109) (NB)",
        "pt-number": "6·0051",
        "pt-page": "93[8]",
        "tlp-number": "5·5423 (2-3) ",
        "cross-references": "9.11.14 (2)+",
        "ger": " / \\\tVexierbilder & das Sehen von Sachverhalten. ",
        "eng": "Puzzle pictures and seeing states of things. [Cf. 5. 5423.]"
    },
    {
        "manuscript": "Ms-102,26r[2] et 27r[1] (1914--1110) (NB)",
        "pt-number": " 4·1001531",
        "pt-page": "41[3]",
        "tlp-number": "4·1121 (3)*",
        "cross-references": "10.11.14 (2)",
        "ger": "Entspricht nicht mein Studium der Zeichensprache dem Studium der Denkprozesse, welches die Philosophen für die Philosophie der Logik immer für so wesentlich hielten? – Nur verwickelten sie sich immer in unwesentliche psychologische Untersuchungen & eine analoge Gefahr gibt es auch bei / meiner Methode. ",
        "eng": "Does not my examination of sign-language correspond to the examination of thought-processes, which philosophers always used to consider so essential to the philosophy of logic? Only they always got involved in irrelevant psychological investigations, and there is an analogous danger in following my method. [See 4.1121 (3).]"
    },
    {
        "manuscript": "Ms-102,27r[2] (1914--1110) (NB)",
        "pt-number": "5·3344",
        "pt-page": "43[9]",
        "tlp-number": "5·5352*",
        "cross-references": "11.11.14 (1)+",
        "date": " / \\\t11.11.14.",
        "ger": "Dies ist falsch: da die Definition der Klassen selbst die Existenz der wirklichen Funktionen verbürgt. ",
        "eng": "This is wrong: since the definition of classes itself guarantees the existence of the real functions. "
    },
    {
        "manuscript": "Ms-102,29r[1] (1914--1112) (NB)",
        "pt-number": " 4·44861",
        "pt-page": "42[3]",
        "tlp-number": "4·464 (2)*",
        "cross-references": "12.11.14 (2)**",
        "ger": "Man könnte die Wahrheit eines Satzes möglich, die einer Tautologie gewiß und die einer Kontradiktion unmöglich nennen. Hier tritt schon das Anzeichen einer Gradation auf die wir in der Wahrscheinlichkeitsrechnung brauchen. ",
        "eng": "One might call the truth of a proposition possible, that of a tautology certain, and that of a contradiction impossible. Here we already get a hint of the graduation needed in probability theory."
    },
    {
        "manuscript": "Ms-102,29r[2] (1914--1112) (NB)",
        "pt-number": " 4·4484",
        "pt-page": "42[1]",
        "cross-references": "12.11.14 (3)",
        "ger": "In der Tautologie bildet der Elementarsatz – selbstverständlich – noch immer ab aber er ist mit der Wirklichkeit so lose verbunden daß dieser unbeschränkte Freiheit hat. Die Kontradiktion wieder setzt solche Schranken daß keine Wirklichkeit in ihnen existieren kann. ",
        "eng": "Of course in a tautology an elementary proposition still depicts, but it is so loosely connected with reality that reality has unlimited freedom. The constraints set by a contradiction in its turn are such that no reality can exist under them."
    },
    {
        "manuscript": "Ms-102,30r[1] (1914--1112) (NB)",
        "pt-number": "5·3031 SchonEnth. 51[6]",
        "pt-page": "5·3031 SchonEnth. 51[6]",
        "cross-references": "5.11.14 (6)**  12.11.14 (5)+",
        "tlp-number": "5·47 (2)*",
        "ger": "Obwohl im einfachen Satz bereits alle logischen Konstanten vorkommen so muß in ihm doch auch sein eigenes Urbild ganz & unzerlegt vorkommen! ",
        "eng": "Although all logical constants already occur in a simple proposition, nevertheless, its own prototype must also occur in it complete and undivided."
    },
    {
        "manuscript": "Ms-102,30r[1] (1914--1112) (NB)",
        "pt-number": "5·3031 SchonEnth. 51[6]",
        "pt-page": "5·3031 SchonEnth. 51[6]",
        "cross-references": "5.11.14 (6)**  12.11.14 (5)+",
        "tlp-number": "5·47 (2)*",
        "ger": "Obwohl im einfachen Satz bereits alle logischen Konstanten vorkommen so muß in ihm doch auch sein eigenes Urbild ganz & unzerlegt vorkommen! ",
        "eng": "Although all logical constants already occur in a simple proposition, nevertheless, its own prototype must also occur in it complete and undivided."
    },
    {
        "manuscript": "Ms-102,31r[4] et 32r[1] (1914--1113) (NB)",
        "pt-number": " 4·4322",
        "pt-page": "41[4]",
        "tlp-number": "4·463 (2)*",
        "cross-references": "14.11.14 (1) ",
        "date": "14.11.14.",
        "ger": "Diese Vorstellung ist sehr deutlich und müßte zur Lösung führen. ",
        "eng": "This idea is very clear and should lead to the solution. "
    },
    {
        "manuscript": "Ms-102,33r[4] et 34r[1] (1914--1115) (NB)",
        "pt-number": " 4·0232",
        "pt-page": "47[6]",
        "tlp-number": "4·023 (3)",
        "cross-references": "15.11.14(6)**  16.1.15 (3)*",
        "ger": "Der Satz ist eben nur die Beschreibung eines Sachverhalts. (Aber das ist alles noch an der Oberfläche.) / Eine Einsicht am Ursprung ist mehr wert als noch so viele irgendwo in der Mitte. ",
        "eng": "One insight at the very beginning is more valuable than ever so many somewhere in the middle. "
    },
    {
        "manuscript": "Ms-102,34r[5] et 35r[1] (1914--1119) (NB)",
        "pt-number": " 3·2102",
        "pt-page": "43[4]",
        "tlp-number": "3·41",
        "cross-references": "19.11.14",
        "date": "19.11.14.",
        "ger": "/ Der Satz & die logischen Koordinaten: das ist der logische Ort. ",
        "eng": "//A sentence plus its logical coordinates: this gives us a logical location. [Cf. 3.41.]//"
    },
    {
        "manuscript": "Ms-102,36r[4] et 37r[1] (1914--1123) (NB)",
        "pt-number": " 3·2104",
        "pt-page": "43[6]",
        "tlp-number": "3·42 (1-2)",
        "cross-references": "23.11.14",
        "date": "23.11.14.",
        "ger": "Obwohl der Satz nur auf einen Ort des logischen Raumes deuten darf  / so muß doch durch ihn schon der ganze logische Raum gegeben sein. – Sonst würden durch Verneinung, Disjunktion etc. immer neue Elemente – und zwar in Koordination – eingeführt was natürlich nicht geschehen darf. ",
        "eng": "Although a proposition may specify only one location in logical space, still the entire logical space must already be given by it. - Otherwise negation, disjunction etc. would introduce more and more new elements - and in coordination – which, of course, must not happen. [Cf. 3.42.]"
    },
    {
        "manuscript": "Ms-102,37r[2] (1914--1124) (NB)",
        "pt-number": " 2·1513",
        "pt-page": "14[3]",
        "cross-references": "24.11.14 (1,4)+",
        "date": "24.11.14.",
        "ger": "Satz und Sachverhalt verhalten sich zu einander wie der Meterstab zu der zu messenden Länge. ",
        "eng": "Proposition and state of things are related to one another like a yardstick and a length to be measured. [Cf. 2.1512.]"
    },
    {
        "manuscript": "Ms-102,37r[2] (1914--1124) (NB)",
        "pt-number": " 2·1513",
        "pt-page": "14[3]",
        "cross-references": "24.11.14 (1,4)+",
        "date": "24.11.14.",
        "ger": "Satz und Sachverhalt verhalten sich zu einander wie der Meterstab zu der zu messenden Länge. ",
        "eng": "Proposition and state of things are related to one another like a yardstick and a length to be measured. [Cf. 2.1512.]"
    },
    {
        "manuscript": "Ms-102,37r[3] et 38r[1] (1914--1124) (NB)",
        "pt-number": " 5·04113",
        "pt-page": "52[3]",
        "tlp-number": "5·1311 (2)**",
        "cross-references": "24.11.14 (2)",
        "ger": "Und das gleiche gilt natürlich für die Allgemeinheitsbezeichnung  / überhaupt. ",
        "eng": "And of course the same holds of any sign for generality. [Cf. 5.1311 (2).]"
    },
    {
        "manuscript": "Ms-102,38r[2] (1914--1124) (NB)",
        "pt-number": " 2·1513",
        "pt-page": "14[3]",
        "cross-references": "24.11.14 (1,4)+",
        "ger": "Im Satze legen wir ein Urbild an die Wirklichkeit an. "
    },
    {
        "manuscript": "Ms-102,38r[2] (1914--1124) (NB)",
        "pt-number": " 2·1513",
        "pt-page": "14[3]",
        "cross-references": "24.11.14 (1,4)+",
        "ger": "Im Satze legen wir ein Urbild an die Wirklichkeit an. "
    },
    {
        "manuscript": "Ms-102,38r[4] et 39r[1] (1914--1124) (NB)",
        "pt-number": " 5·3101",
        "pt-page": "50[2]",
        "tlp-number": "5·5151 (1)**",
        "cross-references": "24.11.14 (6,7)",
        "ger": "     Warum sollte man den negativen nicht durch eine negative Tatsache ausdrücken können?! Es ist wie wenn man statt des Meterstabes den Raum außerhalb des Meterstabes als  / Vergleichsobjekt nähme. ",
        "eng": "     Why shouldn’t it be possible to express a negative proposition by means of a negative fact?! It is as if one were to take the space outside the yardstick as the object of comparison object instead of the yardstick. [Cf. 5.5151.]"
    },
    {
        "manuscript": "Ms-102,45r[2] et 46r[1] (1914--1127) (NB)",
        "pt-number": " 5·312",
        "pt-page": "61[6]",
        "tlp-number": "5·512**",
        "cross-references": "27.11.14",
        "date": "27.11.14.",
        "ger": "„~p” ist wahr wenn p falsch ist. Also, in dem wahren Satz „~p” ist der Teil ein falscher Satz. Wie kann ihn nun der Haken „~” mit der Wirklichkeit zum Stimmen bringen? Wir haben freilich schon gesagt daß es nicht der Haken „~” allein ist sondern alles was den verschiedenen Verneinungszeichen gemeinsam ist. Und was diesen allen gemeinsam ist muß offenbar aus der Bedeutung der Verneinung selbst hervorgehen. Und so muß sich also in dem Negationszeichen  / doch seine eigene Bedeutung spiegeln. ",
        "eng": "\"~p\" is true if p is false. Therefore, part of the proposition \"~p\", when true, is false. How then can the hook \"~\" make it agree with reality? Of course, we have already said that it is not the hook \"~\" alone but what all the different negation signs have in common. And what is common to all of them must obviously follow from the meaning of negation itself. And so the negation sign must surely mirror its own meaning. [Cf 5.512.]"
    },
    {
        "manuscript": "Ms-102,46r[4] (1914--1129) (NB)",
        "pt-number": " 4·1031",
        "pt-page": "41[2]",
        "tlp-number": "4·1212*",
        "cross-references": "29.11.14 (2)",
        "ger": "Was gezeigt werden kann kann nicht gesagt werden. ",
        "eng": "What can be shown cannot be said."
    },
    {
        "manuscript": "Ms-102,46r[5] et 47r[1] (1914--1129) (NB)",
        "pt-number": " 5·32",
        "pt-page": "18[10]",
        "tlp-number": "5·53",
        "cross-references": "29.11.14 (3)+",
        "ger": "Ich glaube man könnte das Gleichheitszeichen ganz aus  / unserer Notation entfernen und die Gleichheit immer nur durch die Gleichheit der Zeichen (u.u.) andeuten. Es wäre dann freilich φ(a,a) kein spezieller Fall von (x, y).φ(x, y) und φa keiner von (∃x,y).φx.φy. Dann aber könnte man statt φx.φy ⊃x, y x = y einfach schreiben ~(∃x, y).φx.φy. ",
        "eng": "I believe one could completely eliminate the identity sign from our notation and always indicate identity just by the identity of the signs (and vice versa). Of course, then φ(a,a) would not be a special case of (x, y).φ(x, y), and φa would not be a special case of (∃x,y).φx.φy. But then, instead of φx.φy ⊃x, y x = y, one could simply write ~(∃x, y).φx.φy. [Cf. 5.53 and 5.533.]"
    },
    {
        "manuscript": "Ms-102,47r[2] (1914--1129) (NB)",
        "pt-number": " 5·334",
        "pt-page": "19[2]",
        "tlp-number": "5·534",
        "cross-references": "29.11.14 (4)+",
        "ger": "Durch diese Notation verlören auch der Scheinsatz (x)x = a oder ähnliche allen Schein von Berechtigung. ",
        "eng": "Also, this notation would remove any semblance of legitimacy from a pseudo-proposition such as (x)x = a. "
    },
    {
        "manuscript": "Ms-102,48r[5] et 49r[1] et 50r[1] et 51r[1] et 52r[1] et 53r[1] (1914--1206) (NB)",
        "pt-number": "6·341",
        "pt-page": "73[2]",
        "tlp-number": "6·343",
        "cross-references": "6.12.14 (6)*",
        "date": "6.12.14.",
        "ger": "Die unsichtbaren Massen Hertz's sind eingestandenermaßen Scheingegenstände.",
        "eng": "Hertz’s invisible masses are admittedly pseudo-objects."
    },
    {
        "manuscript": "Ms-102,48r[5] et 49r[1] et 50r[1] et 51r[1] et 52r[1] et 53r[1] (1914--1206) (NB)",
        "pt-number": "6·341",
        "pt-page": "73[2]",
        "tlp-number": "6·343",
        "cross-references": "6.12.14 (6)*",
        "date": "6.12.14.",
        "ger": "Die unsichtbaren Massen Hertz's sind eingestandenermaßen Scheingegenstände.",
        "eng": "Hertz’s invisible masses are admittedly pseudo-objects."
    },
    {
        "manuscript": "Ms-102,48r[5] et 49r[1] et 50r[1] et 51r[1] et 52r[1] et 53r[1] (1914--1206) (NB)",
        "pt-number": "6·341",
        "pt-page": "73[2]",
        "tlp-number": "6·343",
        "cross-references": "6.12.14 (6)*",
        "date": "6.12.14.",
        "ger": "Die unsichtbaren Massen Hertz's sind eingestandenermaßen Scheingegenstände.",
        "eng": "Hertz’s invisible masses are admittedly pseudo-objects."
    },
    {
        "manuscript": "Ms-102,55r[3] (1914--1215) (NB)",
        "pt-number": "3·2141",
        "pt-page": "43[7]",
        "tlp-number": "3·42 (3a)*",
        "cross-references": "15.12.14 (2)*",
        "ger": "Das logische Gerüst um das Bild (des Satzes) herum bestimmt den logischen Raum. "
    },
    {
        "manuscript": "Ms-102,55r[4] (1914--1216) (NB)",
        "pt-number": "3·2142",
        "pt-page": "43[8]",
        "tlp-number": "3·42 (3b)*",
        "cross-references": "16.12.14*",
        "date": "16.12.14.",
        "ger": "Der Satz muß den ganzen logischen Raum durchgreifen. ",
        "eng": "Propositions must probe the whole of logical space. [Cf. 3.42.]"
    },
    {
        "manuscript": "Ms-102,56r[1] (1914--1217) (NB)",
        "pt-number": "5·23",
        "pt-page": "38[6]",
        "tlp-number": "5·44 (1)*",
        "cross-references": "17.12.14**",
        "date": "17.12.14.",
        "ger": "Die ab-Funktionszeichen sind nicht materiell sonst könnten sie nicht verschwinden. ",
        "eng": "The ab-function signs are not material, otherwise they could not disappear. [Cf. 5.44 and 5.441.]"
    },
    {
        "manuscript": "Ms-102,56r[2] (1914--1218) (NB)",
        "pt-number": "4·073",
        "pt-page": "48[6]",
        "tlp-number": "4·04 (1)",
        "cross-references": "18.12.14**",
        "date": "18.12.14.",
        "ger": "Am eigentlichen Satzzeichen muß geradesoviel zu unterscheiden sein, als am Sachverhalt zu unterscheiden ist. Darin besteht ihre Identität.         ",
        "eng": "In a proper propositional sign there must be exactly as many distinguishable features as can be distinguished in the state of things. That is what their identity consists in.    [Cf. 4.04.]"
    },
    {
        "manuscript": "Ms-102,58r[2] (1914--1225) (NB)",
        "pt-number": "4·0102",
        "pt-page": "41[5]",
        "tlp-number": "4·0312 (1)*",
        "cross-references": "25.12.14 (2)*",
        "ger": " Die Möglichkeit des Satzes basiert natürlich auf dem Prinzip der Vertretung von Gegenständen durch Zeichen. ",
        "eng": "The possibility of propositions is, of course, based on the principle that signs function as representatives for objects. [Cf. 4.0312 (1).]"
    },
    {
        "manuscript": "Ms-102,58r[4] (1914--1225) (NB)",
        "pt-number": "4·0103",
        "pt-page": "41[6]",
        "tlp-number": "4·0312 (2)",
        "cross-references": "25.12.14 (5)*",
        "ger": "Mein Grundgedanke ist daß die logischen Konstanten nicht vertreten. Daß sich die Logik der Tatsache nicht vertreten läßt. ",
        "eng": "My basic idea is that the logical constants are not representatives; that the logic of facts is not amenable to representation. [See 4.0312 (2).]"
    },
    {
        "manuscript": "Ms-102,60r[4] (1915--0116) (NB)",
        "pt-number": "4·0232",
        "pt-page": "47[6]",
        "tlp-number": "4·023 (3)",
        "cross-references": "15.11.14(6)**  16.1.15 (3)*",
        "ger": "Der Satz ist die Beschreibung eines Sachverhalts. ",
        "eng": "A proposition is a description of a state of things.  [See 4.023 (3).]"
    },
    {
        "manuscript": "Ms-102,60r[5] et 61r[1] (1915--0116) (NB)",
        "pt-number": "4·02321",
        "pt-page": "47[7]",
        "tlp-number": "4·023 (4)*",
        "cross-references": "16.1.15 (4)*",
        "ger": "Wie die Beschreibung eines Gegenstandes nach seinen externen Eigenschaften, so beschreibt der  / Satz die Tatsache nach ihren internen Eigenschaften. ",
        "eng": "Just as a description describes an object in accordance with its external properties, so a proposition describes a fact in accordance with its internal properties.  [See 4.023 (4).]"
    },
    {
        "manuscript": "Ms-102,61r[4] et 62r[1] (1915--0117) (NB)",
        "pt-number": "6·35",
        "pt-page": "74[1]",
        "tlp-number": "6·35 (1)",
        "cross-references": "17.1.15 (2)*",
        "ger": "Zu dem Netz-Gleichnis der Physik: Obwohl die Flecke geometrische Figuren sind so kann uns doch selbstverständlich die Geometrie gar nichts über ihre Form & Lage sagen. Das Netz aber ist rein geometrisch alle  / seine Eigenschaften können a priori angegeben werden. ",
        "eng": "On the network analogy for physics: Although the spots are geometrical figures, geometry can obviously tell us nothing about their form and position. But the network is purely geometrical; all its properties can be specified a priori. [See 6.35 (1).]"
    },
    {
        "manuscript": "Ms-102,64r[4] (1915--0123) (NB)",
        "pt-number": "5·0012",
        "pt-page": "63[6]",
        "tlp-number": "5·2341 (2)**",
        "cross-references": "23.1.15 (1)",
        "date": "23.1.15.",
        "ger": "Die Verneinung ist eine Operation. ",
        "eng": "Negation is an operation. [Cf. 5.2341 (2).]"
    },
    {
        "manuscript": "Ms-102,64r[7] et 65r[1] (1915--0123) (NB)",
        "pt-number": "5·0021",
        "pt-page": "64[1]",
        "tlp-number": "5·25 (2)** ",
        "cross-references": "23.1.15 (4)",
        "ger": "Die logischen Scheinfunktionen sind Operationen. ",
        "eng": "Logical pseudo-functions are operations.",
        "date": "24.1.15."
    },
    {
        "manuscript": "Ms-102,65r[2] (1915--0124) (NB)",
        "pt-number": " 5·0022",
        "pt-page": "64[2]",
        "tlp-number": "   5·254*",
        "cross-references": "24.1.15 (2)",
        "eng": "Only operations can vanish. [Cf. 5.254.]"
    },
    {
        "manuscript": "Ms-102,65r[4] (1915--0124) (NB)",
        "pt-number": " 5·311",
        "pt-page": "61[5]",
        "tlp-number": "5·511",
        "cross-references": "24.1.15 (4)*  (6.3.15+)",
        "ger": "Wie kann die allumfassende, weltspiegelnde Logik so spezielle Haken & Manipulationen gebrauchen?! Nur indem sich alle diese zusammen zu einem unendlich feinen Netzwerk, zu dem großen Spiegel verknüpfen! ",
        "eng": "How can an all-embracing, world-reflecting logic use such contrived hooks and manipulations? Only by knitting them all together in an infinitely fine network, the great mirror. [See 5.511.]"
    },
    {
        "manuscript": "Ms-102,65r[6] et 66r[1] (1915--0129) (NB)",
        "pt-number": " 3·1603",
        "pt-page": "38[5]",
        "tlp-number": "3·141 (2)",
        "cross-references": "29.1.15+",
        "ger": "/ Die Sprache ist artikuliert. ",
        "eng": "Language is articulate. [Cf. 3.141 (2).]"
    },
    {
        "manuscript": "Ms-102,66r[2] (1915--0207) (NB)",
        "pt-number": " 3·1602",
        "pt-page": "38[4]",
        "tlp-number": "3·141 (1)**",
        "cross-references": "7.2.15+  5.4.15   11.4.15",
        "date": "7.2.15.",
        "ger": "Die musikalischen Themen sind in gewissem Sinne Sätze. Die Kenntnis des Wesens der Logik wird deshalb zur Kenntnis des Wesens der Musik führen. ",
        "eng": "Musical themes are in a certain sense propositions. So knowledge of the nature of logic will lead to knowledge of the nature of music. [Cf. 3.141 (1).]"
    },
    {
        "manuscript": "Ms-102,66r[3] (1915--0214) (NB)",
        "pt-number": " 4·0231",
        "pt-page": "47[5]",
        "tlp-number": "4·023 (1-2)*",
        "cross-references": "30.10.14 (3)  31.10.14 (3)*  (14.2.15 (2)+)",
        "date": "14.2.15.",
        "ger": "Gäbe es mathematische Gegenstände – logische Konstante – so wäre der Satz „ich esse 5 Pflaumen” ein Satz der Mathematik. Und er ist auch kein Satz der angewandten Mathematik. ",
        "eng": "If there were mathematical objects – logical constants – the proposition \"I am eating five plums\" would be a proposition of mathematics. And it is not even a proposition of applied mathematics."
    },
    {
        "manuscript": "Ms-102,67r[3] (1915--0305) (NB)",
        "pt-number": " 5·30225",
        "pt-page": "76[3]",
        "tlp-number": "5·4541 (2-3)* ",
        "cross-references": "5.3.15 (1)  19.9.16 (1)+",
        "date": "5.3.15.",
        "ger": "Die Menschheit hat immer geahnt, daß es ein Gebiet von Fragen geben muß worin die Antworten – a priori – symmetrisch, und zu einem abgeschlossenen regelmäßigen Gebilde vereint – liegen. ",
        "eng": "People have always had an inkling that there must be a realm in which the answers to questions combine symmetrically - a priori - into a self-contained regular formation. [See 5.4541 (2-3).]"
    },
    {
        "manuscript": "Ms-102,67r[5] et 68r[1] (1915--0306) (NB)",
        "pt-number": " 5·311",
        "pt-page": "61[5]",
        "tlp-number": "5·511",
        "cross-references": "24.1.15 (4)*  (6.3.15+)",
        "date": "6.3.15.",
        "ger": "Die Probleme der Verneinung, der Disjunktion, von Wahr & Falsch – sind nur Spiegelbilder des einen, großen Problems, in  / den verschieden gestellten großen und kleinen Spiegeln der Philosophie. ",
        "eng": "The problems of negation, of disjunction, of true and false, are only reflections of the one great problem in the variously placed great and small mirrors of philosophy. [Cf. 5.511.]"
    },
    {
        "manuscript": "Ms-102,69r[2] (1915--0329) (NB)",
        "pt-number": " 6·3",
        "pt-page": "71[5]",
        "tlp-number": "6·32",
        "cross-references": "29.3.15 (1)",
        "date": "29.3.15.",
        "ger": "Das Kausalitätsgesetz ist kein Gesetz sondern die Form eines Gesetzes. ",
        "eng": "The law of causality is not a law but the form of a law. [See 6.32.]"
    },
    {
        "manuscript": "Ms-102,69r[3] (1915--0329) (NB)",
        "pt-number": " 6·31",
        "pt-page": "71[6]",
        "tlp-number": "6·321**",
        "cross-references": "29.3.15 (2)",
        "ger": "„Kausalitätsgesetz” das ist ein Gattungsname. Und wie es in der Mechanik – sagen wir – Minimumgesetze gibt – etwa der kleinsten Wirkung – so gibt es in der Physik ein Kausalitätsgesetz, ein Gesetz von der Kausalitätsform. ",
        "eng": "“Law of causality”  is a generic name. And just as in mechanics there are, for instance, minimum-laws, such as that of least action, so too in physics there is a law of causality, a law of the form of causality. [Cf. 6.321.]"
    },
    {
        "manuscript": "Ms-102,69r[4] et 70r[1] (1915--0329) (NB)",
        "pt-number": " 6·311",
        "pt-page": "71[7]",
        "tlp-number": "6·3211*",
        "cross-references": "29.3.15 (3,4)*",
        "ger": "     (Hier wie so oft stellt sich das Aprioristische als etwas rein Logisches heraus.) ",
        "eng": "(Here, as so often, what is a priori turns out to be something purely logical.) [Cf. 6.3211.]"
    },
    {
        "manuscript": "Ms-102,71r[2] (1915--0405) (NB)",
        "pt-number": " 3·1602",
        "pt-page": "38[4]",
        "tlp-number": "3·141 (1)**",
        "cross-references": "7.2.15+  5.4.15   11.4.15",
        "date": "5.4.15.",
        "ger": "Der Satz ist kein Wörtergemisch. ",
        "eng": "A sentence is not a mixture of words. [See 3.141.]"
    },
    {
        "manuscript": "Ms-102,71r[3] (1915--0410) (NB)",
        "pt-number": " 3·1602",
        "pt-page": "38[4]",
        "tlp-number": "3·141 (1)**",
        "cross-references": "7.2.15+  5.4.15   11.4.15",
        "date": "11.4.15.",
        "ger": "Auch die Melodie ist kein Tongemisch, wie alle Unmusikalischen glauben. ",
        "eng": "Nor is a tune a mixture of notes, as all unmusical people think. [Cf. 3.141.]"
    },
    {
        "manuscript": "Ms-102,73r[3] (1915--0419) (NB)",
        "pt-number": " 4·1021",
        "pt-page": "17[8]",
        "tlp-number": "4·121 (2)",
        "cross-references": "19.4.15**",
        "date": "19.4.15.",
        "ger": "Was sich in der Sprache spiegelt, kann ich nicht mit ihr ausdrücken. ",
        "eng": "Whatever is mirrored in language I cannot use language to express. [Cf. 4.121 (2).]"
    },
    {
        "manuscript": "Ms-102,73r[4] et 74r[1] (1915--0423) (NB)",
        "pt-number": "6·32",
        "pt-page": "71[8]",
        "tlp-number": "6·33*",
        "cross-references": "23.4.15 (1)",
        "date": "23.4.15.",
        "ger": "Wir glauben nicht a priori an ein Erhaltungsgesetz  / sondern wir wissen a priori die Möglichkeit seiner logischen Form. ",
        "eng": "We do not believe a priori in a law of conservation, rather we know a priori the possibility of its logical form. [See 6.33.]"
    },
    {
        "manuscript": "Ms-102,74r[2] (1915--0423) (NB)",
        "pt-number": "6·33",
        "pt-page": "71[9]",
        "tlp-number": "6·34*",
        "cross-references": "23.4.15 (2)*",
        "ger": "Alle jene a priori gewissen Sätze, wie der Satz vom Grunde von der Kontinuität in der Natur etc. etc., alle diese sind aprioristische Einsichten bezüglich der möglichen Formgebung der Sätze der Wissenschaft. ",
        "eng": "All such a priori certain propositions, including the principle of sufficient reason, the laws of continuity in nature etc. etc. - all these are a priori insights about possible formulations of scientific propositions. [Cf. 6.34.]"
    },
    {
        "manuscript": "Ms-102,74r[3] et 75r[1] (1915--0423) (NB)",
        "pt-number": "5·30633",
        "pt-page": "60[4]",
        "tlp-number": "5·47321 (1)",
        "cross-references": "23.4.15 (3)",
        "ger": "„Ockhams Devise” ist natürlich keine willkürliche oder durch ihren praktischen Erfolg gerechtfertigte Regel. Sie besagt daß unnötige Zeichen-Einheiten nichts be / deuten. ",
        "eng": "Of course, Occam's razor is no arbitrary rule, nor one that is justified by its practical success. Its point is that unnecessary sign-units mean nothing. [See 5.47321 (1).]"
    },
    {
        "manuscript": "Ms-102,75r[2] (1915--0423) (NB)",
        "pt-number": " 5·30634",
        "pt-page": "60[5]",
        "tlp-number": "5·47321 (2)",
        "cross-references": "23.4.15 (4)*",
        "ger": "Es ist klar daß Zeichen, die denselben Zweck erfüllen logisch identisch sind. Das rein Logische ist eben das was alle diese leisten können. ",
        "eng": "It is clear that signs that serve the same purpose are logically identical. What all of these are able to accomplish just is strictly logical. [Cf. 5.47321 (2).]"
    },
    {
        "manuscript": "Ms-102,75r[3] (1915--0424) (NB)",
        "pt-number": " 6·11343",
        "pt-page": "70[5]",
        "tlp-number": "6·1261                   ",
        "cross-references": "24.4.15*",
        "date": "24.4.15.",
        "ger": "In der Logik (Mathematik) sind Prozeß & Resultat gleichwertig. (Darum keine Überraschungen.) ",
        "eng": "In logic (mathematics) process and result are equivalent. (Hence, no surprises.) [See 6.1261.]"
    },
    {
        "manuscript": "Ms-102,77r[2] (1915--0426) (NB)",
        "pt-number": " 6·36",
        "pt-page": "74[2]",
        "tlp-number": "6·35 (2)",
        "cross-references": "25.4.15 (6)",
        "ger": "„Gesetze” wie der Satz vom Grunde etc. handeln vom Netz, nicht von dem was das Netz beschreibt. ",
        "eng": "“Laws” like the principle of sufficient reason, etc. are about the net and not about what the net describes."
    },
    {
        "manuscript": "Ms-102,77r[5] et 78r[1] (1915--0426) (NB)",
        "pt-number": " 3·20104",
        "pt-page": "41[7]",
        "tlp-number": "3·24 (1)",
        "cross-references": "26.4.15 (3)*",
        "ger": "Der Satz welcher vom „Komplex” handelt steht in interner Beziehung zum Satze welcher  / von dessen Bestandteil handelt. ",
        "eng": "A proposition about a \"complex\" stands in a internal relation to a proposition about its constituents. [See 3.24 (1).]"
    },
    {
        "manuscript": "Ms-102,78r[2] (1915--0427) (NB)",
        "pt-number": "5·0444",
        "pt-page": "41[8]",
        "tlp-number": "5·1362 (1)",
        "cross-references": "27.4.15 (1)",
        "date": "27.4.15.",
        "ger": "Die Willensfreiheit besteht darin daß zukünftige Ereignisse jetzt nicht gewußt werden können. Nur dann könnten wir sie wissen, wenn die Kausalität eine innere Notwendigkeit wäre – wie etwa die des logischen Schlusses. – Der Zusammenhang von Wissen & Gewußtem ist der der logischen Notwendigkeit. ",
        "eng": "Freedom of the will consists in the impossibility of our knowing future events now. We could know them only if causality were an inner necessity like, say, that of logical inference. - The connection between knowing and the known is that of logical necessity."
    },
    {
        "manuscript": "Ms-102,79r[5] et 80r[1] (1915--0428) (NB)",
        "pt-number": " 5·04103",
        "pt-page": "61[2]",
        "tlp-number": "5·124",
        "cross-references": "28.4.15 (5)+   30.4.15 (2)+",
        "ger": "Gehört das Zeichen p.q auch  / unter diejenigen welche p bejahen? – Ist p eins von den Zeichen für p ⌵ q? ",
        "eng": "Does the sign p.q also belong among those which affirm p? - Is p one of the signs for p ⌵ q?"
    },
    {
        "manuscript": "Ms-102,81r[2] (1915--0430) (NB)",
        "pt-number": "5·04105",
        "pt-page": "61[4]",
        "tlp-number": "5·1241 (3)",
        "cross-references": "30.4.15 (3)+",
        "ger": "     Jeder Satz der p widerspricht verneint p. ",
        "eng": "Every proposition that contradicts p denies p. [See 5.1241 (3).]"
    },
    {
        "manuscript": "Ms-102,81r[2] (1915--0430) (NB)",
        "pt-number": "5·04105",
        "pt-page": "61[4]",
        "tlp-number": "5·1241 (3)",
        "cross-references": "30.4.15 (3)+",
        "ger": "     Jeder Satz der p widerspricht verneint p. ",
        "eng": "Every proposition that contradicts p denies p. [See 5.1241 (3).]"
    },
    {
        "manuscript": "Ms-102,81r[3] (1915--0501) (NB)",
        "pt-number": " 6·1201",
        "pt-page": "116[7]",
        "tlp-number": "6·1201 ",
        "cross-references": "1.5.15 (1)**",
        "date": "1.5.15.",
        "ger": "Daß p.~p eine Kontradiktion ist zeigt daß ~p p widerspricht. ",
        "eng": "That p.~p is a contradiction shows that ~p contradicts p. [Cf. 6.1201.]"
    },
    {
        "manuscript": "Ms-102,81r[4] (1915--0501) (NB)",
        "pt-number": "6·51",
        "pt-page": "50[1]",
        "cross-references": "1.5.15 (2,3)*",
        "ger": "Skeptizismus ist nicht unwiderleglich sondern offenbar unsinnig wenn er bezweifeln will wo nicht gefragt werden kann. ",
        "eng": "Scepticism is not irrefutable, but obviously nonsensical, if it tries to raise doubts where no questions can be asked. [See 6.51 (1).]"
    },
    {
        "manuscript": "Ms-102,81r[5] et 82r[1] (1915--0501) (NB)",
        "pt-number": " 6·51",
        "pt-page": "50[1]",
        "tlp-number": "6·51",
        "cross-references": "1.5.15 (2,3)*",
        "ger": "Denn Zweifel kann nur bestehen wo eine Frage besteht; eine Frage kann nur bestehen wo eine Antwort besteht, und diese  / nur wo etwas gesagt werden kann. ",
        "eng": "For doubt can only exist where there is a question, a question can only exist where there is an answer, and an answer only where something can be said. [See 6.51 (2).]"
    },
    {
        "manuscript": "Ms-102,83r[2] (1915--0502) (NB)",
        "pt-number": "5·3131",
        "pt-page": "61[9]",
        "tlp-number": "5·513 (1)",
        "cross-references": "2.5.15+",
        "date": "2.5.15.",
        "ger": "Die Klasse aller Zeichen die sowohl p als auch q bejahen ist das Zeichen für p.q. Die Klasse aller Zeichen die entweder p oder q bejahen ist der Satz „p ⌵ q”. ",
        "eng": "The class of all signs that affirm both p and q is the class of signs for p.q. The class of all signs that affirm either p or q is the proposition \"p ⌵ q\". [Cf 5.513 (1).]"
    },
    {
        "manuscript": "Ms-102,83r[4] et 84r[1] (1915--0503) (NB)",
        "pt-number": "5·04104",
        "pt-page": "61[3]",
        "tlp-number": "5·1241 (2)",
        "cross-references": "3.5.15 (2)+",
        "ger": "Kann man sagen: Zwei Sätze sind einander entgegengesetzt wenn  / es kein Zeichen gibt das sie beide bejaht – was eigentlich heißt: wenn sie kein gemeinsames Glied haben. ",
        "eng": "Can one say: two propositions are opposites of one another if there is no sign that affirms them both - which really means: if they have no common term? [Cf. 5.1241 (2).]"
    },
    {
        "manuscript": "Ms-102,84r[2] (1915--0503) (NB)",
        "pt-number": "5·3132",
        "pt-page": "62[1]",
        "tlp-number": "5·513 (2)",
        "cross-references": "3.5.15 (3)+   6.6.15 (13)*",
        "ger": " /\tMan stellt sich also die Sätze als Klassen von Zeichen vor – die Sätze „p” und „q” haben das Glied „p.q” gemeinsam – und zwei Sätze sind einander entgegengesetzt wenn sie ganz außerhalb einander liegen. ",
        "eng": "So one imagines propositions as classes of signs - the propositions \"p\" and \"q\" have the term \"p.q\" in common - and two propositions are opposites if they lie entirely outside one another. [Cf. 5.513 (2).]"
    },
    {
        "manuscript": "Ms-102,84r[3] (1915--0504) (NB)",
        "pt-number": " 6·12112",
        "pt-page": "71[4]",
        "tlp-number": "6·31",
        "cross-references": "4.5.15 (1)",
        "date": "4.5.15.",
        "ger": "Das sogenannte Gesetz der Induktion kann jedenfalls kein logisches Gesetz sein, denn es ist offenbar ein Satz. ",
        "eng": "At any rate, what has been styled the law of induction cannot be a law of logic, for it is obviously a proposition. [See 6.31.]"
    },
    {
        "manuscript": "Ms-102,85r[2] (1915--0505) (NB)",
        "pt-number": " 5·305",
        "pt-page": "47[1]",
        "tlp-number": "5·47 (5)",
        "cross-references": "(5.5.15+)",
        "date": "5.5.15.",
        "ger": "Ja, wenn darunter die eine „logische Konstante” verstanden ist! ",
        "eng": "Yes, if by that is understood the sole \"logical constant\".  [Cf. 5.47 (4-5).]"
    },
    {
        "manuscript": "Ms-102,89r[3] et 90r[1] (1915--0509) (NB)",
        "pt-number": " 3·20211",
        "pt-page": "51[3]",
        "tlp-number": "3·261*",
        "cross-references": "9.5.15 (4)+",
        "ger": "Wenn es wahr ist daß jedes definierte Zeichen via seine Definitionen bezeichnet dann muß wohl die Kette der Definitionen  / einmal ein Ende haben. ",
        "eng": "If it is true that every defined sign signifies via its definitions then presumably the chain of definitions must end at some point. [Cf. 3.261.]"
    },
    {
        "manuscript": "Ms-102,95r[4] (1915--0514) (NB)",
        "pt-number": "4·0012",
        "pt-page": "36[7]",
        "tlp-number": "4·002 (2)",
        "cross-references": "14.5.15 (1)",
        "date": "14.5.15.",
        "ger": "Die Sprache ist ein Teil unseres Organismus, und nicht weniger kompliziert als dieser. ",
        "eng": "Language is a part of our organism and no less complicated than it. [Cf. 4.002.]"
    },
    {
        "manuscript": "Ms-102,97r[3] (1915--0515) (NB)",
        "pt-number": "3·20105",
        "pt-page": "58[7]",
        "tlp-number": "3·24 (2)",
        "cross-references": "15.5.15 (3-4)*",
        "ger": "Soviel ist klar, daß ein Komplex nur durch seine Beschreibung gegeben sein kann; und diese stimmen oder nicht stimmen wird. ",
        "eng": "So much is clear, that a complex can be given only by its description; which either will fit or not fit. [See 3.24.]"
    },
    {
        "manuscript": "Ms-102,97r[4] (1915--0515) (NB)",
        "pt-number": "3·20105",
        "pt-page": "58[7]",
        "tlp-number": "3·24 (2)",
        "cross-references": "15.5.15 (3-4)*",
        "ger": "Der Satz in welchem von einem Komplex die Rede ist, wird, wenn dieser nicht existiert, nicht unsinnig, sondern einfach falsch sein! ",
        "eng": "A proposition that mentions a complex that does not exist will not be nonsensical, but just false. [See 3.24.]"
    },
    {
        "manuscript": "Ms-102,98r[2] (1915--0516) (NB)",
        "pt-number": "3·032",
        "pt-page": "42[8]",
        "tlp-number": "3·032*",
        "cross-references": "16.5.15 (2)",
        "ger": "Etwas „der Logik Widersprechendes” in der Sprache darstellen kann man ebensowenig, wie in der Geometrie eine den Gesetzen des Raumes widersprechende Figur durch ihre Koordinaten darzustellen, oder etwa die Koordinaten eines Punktes zu geben welcher nicht existiert. ",
        "eng": "It is as impossible to represent something that “contradicts logic” in language as it is to represent by its co-ordinates a figure that contradicts the laws of space, or, say, to give the co-ordinates of a point that does not exist. [See 3.032.]"
    },
    {
        "manuscript": "Ms-102,99r[2] (1915--0517? --0518?) (NB)",
        "pt-number": "4·0101",
        "pt-page": "42[5]",
        "tlp-number": "4·015",
        "cross-references": "18.5.15 (1)",
        "date": "18.5.15.",
        "ger": "Die Möglichkeit aller Gleichnisse, der ganzen Bildhaftigkeit unserer Ausdrucksweise, ruht in der Logik der Abbildung. ",
        "eng": "The possibility of all similes, of all the pictoriality of our language, reposes in the logic of depiction. [4.015.]"
    },
    {
        "manuscript": "Ms-102,100r[4] et 101r[1] (1915--0521) (NB)",
        "pt-number": " 3·0321",
        "pt-page": "43[1]",
        "tlp-number": "3·0321",
        "cross-references": "21.5.15*",
        "ger": "Wohl können wir einen Tatbestand räumlich darstellen welcher den Gesetzen der  / Physik, aber keinen der den Gesetzen der Geometrie zuwiderliefe. ",
        "eng": "While we are able to give a spatial representation of a matter of fact running foul of the laws of physics, we cannot give such a representation of one that would run counter to the laws of geometry. [See 3.0321.]"
    },
    {
        "manuscript": "Ms-102,101r[4] (1915--0523) (NB)",
        "pt-number": "5·335",
        "pt-page": "59[6]",
        "tlp-number": "5·6",
        "cross-references": "23.5.15 (1)",
        "date": "23.5.15.",
        "ger": "Die Grenzen meiner Sprache bedeuten die Grenzen meiner Welt. ",
        "eng": "The limits of my language mean the limits of my world. [5.6]"
    },
    {
        "manuscript": "Ms-102,102r[2] (1915--0523) (NB)",
        "pt-number": " 5·3351",
        "pt-page": "59[7]",
        "tlp-number": "5·62 (1)*",
        "cross-references": "23.5.15 (3)*",
        "ger": "Die vorige Bemerkung gibt den Schlüssel zur Entscheidung inwieweit der Solipsismus eine Wahrheit ist. ",
        "eng": "The previous remark provides the key to deciding how much truth there is in solipsism. [See 5.62 (1).]"
    },
    {
        "manuscript": "Ms-102,102r[3] (1915--0523) (NB)",
        "pt-number": " 5·33541",
        "pt-page": "76[2]",
        "tlp-number": "5·631 (2)* ",
        "cross-references": "23.5.15 (4,11)*",
        "ger": "Schon lange war es mir bewußt daß ich ein Buch schreiben könnte „Was für eine Welt ich vorfand.”. ",
        "eng": "I have long been aware that I could write a book: \"The sort of world I found\". [Cf. 5.631.]"
    },
    {
        "manuscript": "Ms-102,103r[2] (1915--0523) (NB)",
        "pt-number": " 3·2531",
        "pt-page": "59[1]",
        "tlp-number": "3·3442",
        "cross-references": "23.5.15 (6)*",
        "ger": "Nehmen wir an der komplexe Gegenstand sei dies Buch; es heiße „A”. Dann zeigt doch das Vorkommen des „A” im Satz das Vorkommen des Buches in der Tatsache an. Es löst sich eben auch bei der Analyse nicht willkürlich auf, so daß etwa seine Auflösung in jedem Satzgefüge eine gänzlich verschiedene wäre. – ",
        "eng": "Suppose the complex object is this book. Let it be called \"A\". Then surely the occurrence of \"A\" in the proposition indicates the occurrence of the book in the fact. Even giving an analysis does not yield an arbitrary resolution: for instance, \"A\" would not have an entirely different resolution in every composite proposition."
    },
    {
        "manuscript": "Ms-102,104r[2] (1915--0523) (NB)",
        "pt-number": "5·4103",
        "pt-page": "80[8]",
        "tlp-number": "4·2211** ",
        "cross-references": "23.5.15 (8)+   17.6.15 (8)+",
        "ger": "Trotzdem scheint nun der unendlich komplexe Sachverhalt ein Unding zu sein! ",
        "eng": "Nevertheless, an infinitely complex state of things now looks preposterous."
    },
    {
        "manuscript": "Ms-102,105r[2] (1915--0523) (NB)",
        "pt-number": " 5·33541",
        "pt-page": "76[2]",
        "tlp-number": "5·631 (2)* ",
        "cross-references": "23.5.15 (4,11)*",
        "ger": "In dem Buch „Die Welt welche ich vorfand” wäre auch über meinen Leib zu berichten und zu sagen welche Glieder meinem Willen unterstehen etc. Dies ist nämlich eine Methode das Subjekt zu isolieren oder vielmehr zu zeigen daß es in einem wichtigen Sinne kein Subjekt gibt: Von ihm allein nämlich könnte in diesem Buche nicht die Rede sein. – ",
        "eng": "The book called The World I Found would also have to report on my body and say which parts are subject to my will, etc. For this is a method of isolating the subject, or rather of showing that in an important sense there is no subject; for it alone could not be mentioned in that book. –"
    },
    {
        "manuscript": "Ms-102,107r[3] et 108r[1] (1915--0525) (NB)",
        "pt-number": " 6·52",
        "pt-page": "76[1]",
        "tlp-number": "6·52",
        "cross-references": "25.5.15 (2)*",
        "ger": "Der Trieb zum Mystischen kommt von der Unbefriedigtheit unserer Wünsche durch die Wissenschaft. Wir fühlen daß selbst, wenn alle möglichen wissenschaftlichen Fragen beantwortet sind unser Problem noch gar nicht  / berührt ist. Freilich bleibt dann eben keine Frage mehr; und eben dies ist die Antwort.",
        "eng": "The drive towards what is mystical arises out of the frustration of our desires by science. We feel that even if all possible scientific questions were answered, our problem would still not have been touched at all. To be sure, there would then be no question left, and just this is the answer. [Cf. 6.52.]"
    },
    {
        "manuscript": "Ms-102,108r[2] (1915--0525) (NB)",
        "pt-number": " 4·449",
        "pt-page": "45[6]",
        "tlp-number": "4·465**",
        "cross-references": "3.10.14 (4)  25.5.15 (4)",
        "ger": "Und „ohne seinen Sinn zu ändern” heißt: ohne das Wesentliche am Zeichen selbst zu ändern. Denn; man kann das Zeichen nicht ändern ohne seinen Sinn zu ändern. [Cf. 4.465.]",
        "eng": "And \"without altering its sense\" means: without altering what is essential about the sign itself. For a sign cannot be altered without altering its sense. [Cf. 4.465.]"
    },
    {
        "manuscript": "Ms-102,111r[4] (1915--0528) (NB)",
        "pt-number": "4·001",
        "pt-page": "17[7]",
        "cross-references": "28.5.15 (2,3)+",
        "ger": "Ist es eine Tautologie zu sagen: die Sprache besteht aus Sätzen? ",
        "eng": "Is it a tautology to say: Language consists of sentences?"
    },
    {
        "manuscript": "Ms-102,111r[5] et 112r[1] (1915--0529) (NB)",
        "pt-number": " 5·3353",
        "pt-page": "60[2]",
        "tlp-number": "5·62 (3)*",
        "cross-references": "29.5.15 (1, 5)+",
        "date": "29.5.15.",
        "ger": "     Warum soll es nicht eine Ausdrucksweise geben mit der ich über die Sprache reden kann, so daß diese mir in Koordination mit etwas Anderem erscheinen kann? ",
        "eng": "     Why shouldn’t there be a form of expression in which I can speak about language in such a way that it can appear to me in coordination with something else?"
    },
    {
        "manuscript": "Ms-102,112r[4] (1915--0529) (NB)",
        "pt-number": "5·3353",
        "pt-page": "60[2]",
        "tlp-number": "5·62 (3)*",
        "cross-references": "29.5.15 (1, 5)+",
        "ger": "Wie ist die Sprache unik? "
    },
    {
        "manuscript": "Ms-102,114r[2] (1915--0530) (NB)",
        "pt-number": " 3·253",
        "pt-page": "58[8]",
        "tlp-number": "3·327**  30.5.15 (7,13)**",
        "cross-references": "3·327**  30.5.15 (7,13)**",
        "ger": "Je nach der Verschiedenheit der Struktur des Komplexes bezeichnet sein Name in anderer Art & Weise und unterliegt anderen syntaktischen Gesetzen. ",
        "eng": "In accordance with the difference in the structure of the complex, the name of the complex refers in a different way and is subject to different syntactic laws."
    },
    {
        "manuscript": "Ms-102,116r[2] (1915--0530) (NB)",
        "pt-number": " 3·253",
        "pt-page": "58[8]",
        "tlp-number": "3·327**  30.5.15 (7,13)**",
        "cross-references": "3·327**  30.5.15 (7,13)**",
        "ger": "Namen kennzeichnen die Gemeinsamkeit einer Form und eines Inhalts. – Sie kennzeichnen erst mit ihrer syntaktischen Verwendung zusammen eine bestimmte logische Form. ",
        "eng": "Names characterize what one form and one content have in common. — They characterize one particular logical form only in tandem with their syntactical employment.  [Cf. 3·31 (4), 3.327.]"
    },
    {
        "manuscript": "Ms-102,116r[3] (1915--0531) (NB)",
        "pt-number": "5·323",
        "pt-page": "62[4]",
        "tlp-number": "5·526 (1)",
        "cross-references": "17.10.14 (3)* 19.10.14 (3)**   31.5.15 (1,4)+",
        "date": "31.5.15.",
        "ger": "Mit der Weltbeschreibung durch Namen kann man nicht mehr leisten als mit der allgemeinen Weltbeschreibung!!! ",
        "eng": "Using names in a description of the world one cannot achieve more than one can with a general world description!!!"
    },
    {
        "manuscript": "Ms-102,117r[1] (1915--0531) (NB)",
        "pt-number": " 5·323",
        "pt-page": "62[4]",
        "tlp-number": "5·526 (1)",
        "cross-references": "17.10.14 (3)* 19.10.14 (3)**   31.5.15 (1,4)+",
        "ger": "     Und wenn die allgemeine Weltbeschreibung wie eine Schablone der Welt ist, so nageln sie die Namen so an die Welt daß sie sich überall mit ihr deckt. ",
        "eng": "     And if a general description of the world is like a mask for the world, names attach it to the world so that the world is completely covered by it."
    },
    {
        "manuscript": "Ms-102,119r[4] (1915--0603) (NB)",
        "pt-number": " 5·06",
        "pt-page": "12[8]",
        "tlp-number": "5·14",
        "cross-references": "3.6.15 (1)+  11.6.15 (4,5)+",
        "date": "3.6.15.",
        "ger": "Man könnte wohl sagen: Der Satz sagt am meisten, aus welchem am meisten folgt. ",
        "eng": "One could surely say: That proposition from which the most follows says the most. [Cf. 5.14.]"
    },
    {
        "manuscript": "Ms-102,120r[2] (1915--0603) (NB)",
        "pt-number": "5·08",
        "pt-page": "37[8]",
        "tlp-number": "5·143 (1)",
        "cross-references": "5.6.15 (6)+  3.6.15 (7)+",
        "ger": "     Analoges gilt von ihrem Gegenteil. ",
        "eng": "     The analogous point applies to its opposite. [Cf. 5.143 (1).]"
    },
    {
        "manuscript": "Ms-102,120r[2] (1915--0603) (NB)",
        "pt-number": "5·08",
        "pt-page": "37[8]",
        "tlp-number": "5·143 (1)",
        "cross-references": "5.6.15 (6)+  3.6.15 (7)+",
        "ger": "     Analoges gilt von ihrem Gegenteil. ",
        "eng": "     The analogous point applies to its opposite. [Cf. 5.143 (1).]"
    },
    {
        "manuscript": "Ms-102,120r[3] et 121r[1] (1915--0603) (NB)",
        "pt-number": "4·4492",
        "pt-page": "58[6]",
        "tlp-number": "4·466 (4)**",
        "cross-references": "3.6.15 (8)**",
        "ger": "     Aber wenn die Kontradiktion die Klasse aller Sätze ist, so wird die Tautologie das Gemeinsame aller Klassen von Sätzen welche nichts Gemeinsames haben, und verschwindet gänzlich. „p ⌵ ~p” wäre also nur scheinbar ein Zeichen. In Wirklichkeit aber die Auflösung des Satzes. ",
        "eng": "     But if contradiction is the class of all propositions, then tautology becomes that shared feature of any classes of propositions that have nothing in common, and vanishes altogether. \"p ⌵ ~p\" would then only appear to be a sign. But in reality, the disintegration of the proposition. [Cf. 5.143 (1-2); 4.466 (4).]"
    },
    {
        "manuscript": "Ms-102,120r[3] et 121r[1] (1915--0603) (NB)",
        "pt-number": "4·4492",
        "pt-page": "58[6]",
        "tlp-number": "4·466 (4)**",
        "cross-references": "3.6.15 (8)**",
        "ger": "     Aber wenn die Kontradiktion die Klasse aller Sätze ist, so wird die Tautologie das Gemeinsame aller Klassen von Sätzen welche nichts Gemeinsames haben, und verschwindet gänzlich. „p ⌵ ~p” wäre also nur scheinbar ein Zeichen. In Wirklichkeit aber die Auflösung des Satzes. ",
        "eng": "     But if contradiction is the class of all propositions, then tautology becomes that shared feature of any classes of propositions that have nothing in common, and vanishes altogether. \"p ⌵ ~p\" would then only appear to be a sign. But in reality, the disintegration of the proposition. [Cf. 5.143 (1-2); 4.466 (4).]"
    },
    {
        "manuscript": "Ms-102,121r[2] et 122r[1] (1915--0603) (NB)",
        "pt-number": " 5·081",
        "pt-page": "37[9]",
        "tlp-number": "5·143 (2)",
        "cross-references": "3.6.15 (9)",
        "ger": "Die Tautologie verschwindet sozusagen innerhalb allen Sätzen die Kontradiktion  / außerhalb allen Sätzen. ",
        "eng": "Tautology vanishes so to speak inside all propositions, contradiction outside them. [See 5.143 (2).]"
    },
    {
        "manuscript": "Ms-102,122r[3] (1915--0603) (NB)",
        "pt-number": "5·082",
        "pt-page": "37[10]",
        "tlp-number": "5·143 (3)*",
        "cross-references": "3.6.15 (11)",
        "ger": "Die Kontradiktion ist die äußere Grenze der Sätze; kein Satz bejaht sie. Die Tautologie ist ihr substanzloser Mittelpunkt. (Man kann den Mittelpunkt einer Kreisfläche als deren innere Begrenzung auffassen.) ",
        "eng": "Contradiction is the outer limit of propositions; no proposition affirms it. Tautology is their substanceless centre.  (One can regard the center of a circular area as its inner limit). [Cf. 5.143 (3).]"
    },
    {
        "manuscript": "Ms-102,123r[5] et 124r[1] (1915--0604) (NB)",
        "pt-number": "5·315",
        "pt-page": "62[3]",
        "tlp-number": "5·515**",
        "cross-references": "5.6.15 (7)+   4.6.15   ",
        "date": "4.6.15.",
        "eng": "\"p.q\" only makes sense if \"p ⌵ q\" makes sense."
    },
    {
        "manuscript": "Ms-102,125r[3] (1915--0605) (NB)",
        "pt-number": "4·4462",
        "pt-page": "45[1]",
        "tlp-number": "4·461 (1)",
        "cross-references": "5.6.15 (5)**",
        "ger": " /\tEs muß sich im Satz selbst zeigen daß er etwas sagt und an der Tautologie daß sie nichts sagt. ",
        "eng": "The proposition itself must show that it says something, and the tautology that it says nothing."
    },
    {
        "manuscript": "Ms-102,125r[5] et 126r[1] (1915--0605) (NB)",
        "pt-number": "5·315",
        "pt-page": "62[3]",
        "tlp-number": "5·515**",
        "cross-references": "5.6.15 (7)+   4.6.15   ",
        "ger": "⨯\tIn dem eigentlichen Zeichen für p liegt wirklich schon das  / Zeichen „p ⌵ q”. (Denn es ist dann möglich dieses Zeichen ohne Weiteres zu bilden.) ",
        "eng": "The sign \"p ⌵ q\" is already contained in the proper sign for p. (For it is then possible to form this sign automatically)."
    },
    {
        "manuscript": "Ms-102,126r[5] et 127r[1] (1915--0606) (NB)",
        "pt-number": " 4·4482",
        "pt-page": "45[5]",
        "tlp-number": "4·462 (1)",
        "cross-references": "3.10.14 (4)  6.6.15 (4)",
        "ger": "Sie ist kein Bild der Wirklichkeit insofern als sie nichts darstellt. / Sie ist das, was alle Bilder – einander widersprechende – gemeinsam haben. ",
        "eng": "It is not a picture of reality in that it represents nothing. It is what all—mutually contradictory—pictures have in common."
    },
    {
        "manuscript": "Ms-102,129r[1] (1915--0606) (NB)",
        "pt-number": "5·3132",
        "pt-page": "62[1]",
        "tlp-number": "5·513 (2)",
        "cross-references": "3.5.15 (3)+   6.6.15 (13)*",
        "ger": " ⨯\tJeder Satz hat nur ein Negativ; … Es gibt nur einen Satz der ganz außerhalb von „p” liegt. ",
        "eng": "Every proposition has only one negative; ... There is only one proposition that lies entirely outside \"p\"."
    },
    {
        "manuscript": "Ms-102,131r[3] et 132r[1] (1915--0608) (NB)",
        "pt-number": "6·1214",
        "pt-page": "66[3]",
        "tlp-number": "6·1264 (2)*                 8.6.15 (1)**",
        "cross-references": "6·1264 (2)*                 8.6.15 (1)**",
        "date": "8.6.15.",
        "ger": "Jeder „mathematische Satz” ist ein in Zeichen dargestellter  / Modus ponens. (Und es ist klar, daß man den Modus ponens nicht in einem Satz ausdrücken kann.) ",
        "eng": "Every \"mathematical proposition\" is a modus ponens set out in signs. (And clearly modus ponens cannot be expressed in a proposition). [Cf. 6.1264 (2).]"
    },
    {
        "manuscript": "Ms-102,135r[1] (1915--0610) (NB)",
        "pt-number": " 5·224",
        "pt-page": "37[4]",
        "tlp-number": "5·43 (2)",
        "cross-references": "10.6.15 (5)**",
        "ger": "„p ∙ q ⌵ ~q” sagt dasselbe wie „p ∙ r ⌵ ~r” – was immer q und r besagen mag –: Alle Tautologien besagen dasselbe. (Nämlich nichts.) [Die beiden Beispiele sind untereinander zu schreiben.] ",
        "eng": "—whatever q and r may say—: All tautologies say the same thing. (Namely nothing.) [Cf. 5.43.]"
    },
    {
        "manuscript": "Ms-102,135r[3] et 136r[1] (1915--0610) (NB)",
        "pt-number": " 4·4481",
        "pt-page": "38[1]",
        "tlp-number": "4·4611**",
        "cross-references": "10.6.15 (7)**",
        "ger": "Da ich nun aber doch p ⌵ ~p und p.~p hinschreiben kann, zumal in Verbindung mit anderen  / Sätzen so muß klar gestellt werden welche Rolle diese Scheinsätze nun, besonders in jenen Verbindungen, spielen. Denn sie sind natürlich nicht als ein völlig bedeutungsloses Anhängsel – wie etwa ein bedeutungsloser Name – zu behandeln. Sie gehören vielmehr mit in den Symbolismus – wie die „0” in der Arithmetik. [Cf. 4.4611.]",
        "eng": "But since I can still write down p ⌵ ~p and p.~p, particularly in connection with other sentences, it must be made clear what role these pseudo-propositions now play, especially in such connections. For they are not, of course, to be treated as a completely meaningless appendage—like a meaningless name, for instance. Rather, they belong to the symbolism—like \"0\" in arithmetic."
    },
    {
        "manuscript": "Ms-102,137r[4] et 138r[1] (1915--0611) (NB)",
        "pt-number": " 5·06",
        "pt-page": "12[8]",
        "tlp-number": "5·14",
        "cross-references": "3.6.15 (1)+  11.6.15 (4,5)+",
        "ger": "     Aus p folgt ~q; aus q nicht ~p –? ",
        "eng": "We said: if p follows from q but not q from p, then q says more than p. However, if it now follows from p that q is false, but not from q that p is false, what then? "
    },
    {
        "manuscript": "Ms-102,143r[3] et 144r[1] (1915--0614) (NB)",
        "pt-number": "5·4101",
        "pt-page": "81[1]",
        "tlp-number": "4·221 (1) ",
        "cross-references": "14.6.15 (6)+",
        "ger": "Es hat also den Anschein, daß sich die Existenz der einfachen Gegenstände zu der der komplexen so verhält wie der Sinn von ~p zum Sinn von p: Der einfache Gegenstand sei im komplexen präjudiziert. ",
        "eng": "So it looks as if the existence of simple objects is related to the existence of complex objects in the same way as the sense of ~p to the sense of p: The simple object is prejudged in the complex one. "
    },
    {
        "manuscript": "Ms-102,151r[2] (1915--0615) (NB)",
        "pt-number": "5·09311",
        "pt-page": "94[4]",
        "tlp-number": "5·156 (4)* ",
        "cross-references": "16.6.15 (13)*",
        "ger": "Ein Satz mag also zwar ein unvollständiges Bild einer gewissen Tatsache sein, aber er ist immer ein vollständiges Bild. ",
        "eng": "So a proposition may well be an incomplete picture of a certain fact, but it is always a complete picture. [Cf. 5.156 (4).]"
    },
    {
        "manuscript": "Ms-102,154r[4] et 154r[1] (1915--0617) (NB)",
        "pt-number": " 5·4103",
        "pt-page": "80[8]",
        "tlp-number": "4·2211** ",
        "cross-references": "23.5.15 (8)+   17.6.15 (8)+",
        "ger": "Gegen eine unendliche Zerlegbarkeit scheint auch nichts  / zu sprechen. ",
        "eng": "And nothing seems to speak against infinite decomposability."
    },
    {
        "manuscript": "Ms-102,156r[2] (1915--0617) (NB)",
        "pt-number": "2·026",
        "pt-page": "27[11]",
        "cross-references": "17.6.15 (11)+",
        "ger": "Die Welt hat eine feste Struktur. ",
        "eng": "The world has a stable structure."
    },
    {
        "manuscript": "Ms-102,161r[1] (1915--0618) (NB)",
        "pt-number": " 3·20101",
        "pt-page": "44[4]",
        "tlp-number": "3·23**",
        "cross-references": "18.6.15 (2)**",
        "ger": "Die Forderung der einfachen Dinge ist die Forderung der Bestimmtheit des Sinnes. ",
        "eng": "To postulate simple things is to postulate that sense is determinate. [Cf. 3.23.]"
    },
    {
        "manuscript": "Ms-102,168r[3] (1915--0619) (NB)",
        "pt-number": " 6·005",
        "pt-page": "93[7]",
        "tlp-number": "5·5423 (1) ",
        "cross-references": "19.6.15 (1)+",
        "date": "19.6.15.",
        "ger": "Wenn wir sehen daß unser Gesichtsbild komplex ist so sehen wir aber auch daß es aus einfacheren Teilen besteht. ",
        "eng": "When we see that our visual field is complex, we also see that it consists of simpler parts."
    },
    {
        "manuscript": "Ms-102,174r[3] (1915--0620) (NB)",
        "pt-number": " 2·0126",
        "pt-page": "87[6]",
        "tlp-number": "2·0124",
        "cross-references": "20.6.15 (5, 10)",
        "ger": "Aber es ist doch Tatsache daß diese Sätze auf die solide Wirklichkeit angewandt werden. ",
        "eng": "But surely it is a fact that these propositions are applied to solid reality."
    },
    {
        "manuscript": "Ms-102,176r[1] (1915--0620) (NB)",
        "pt-number": " 2·0126",
        "pt-page": "87[6]",
        "tlp-number": "2·0124",
        "cross-references": "20.6.15 (5, 10)",
        "ger": "     Also handelt der vervollständigte physikalische Satz doch von den Dingen Relationen u.s.w. (Was eigentlich zu erwarten war.) ",
        "eng": "     So the complete physical proposition does deal with things, relations, and so on, after all. (Which was to be expected, for that matter.)"
    },
    {
        "manuscript": "Ms-102,184r[3] et 185r[1] (1915--0621) (NB)",
        "pt-number": "3·20106",
        "pt-page": "58[9]",
        "tlp-number": "3·24 (3)*",
        "cross-references": "21.6.15 (7,12)**",
        "ger": "Daß ein Name einen komplexen Gegenstand bezeichnet sieht man aus einer Unbestimmtheit in den Sätzen in welchen er vorkommt, die  / eben von der Allgemeinheit solcher Sätze herrührt. Wir wissen durch diesen Satz ist noch nicht alles bestimmt. Die Allgemeinheitsbezeichnung enthält ja ein Urbild. ",
        "eng": "When a name signifies a complex, this can be seen in an indeterminateness in the propositions in which it occurs. That is due to the generality of such propositions. We know that not everything is already specified by this proposition. After all, the sign for generality contains a prototype. [Cf. 3.24 (3).]"
    },
    {
        "manuscript": "Ms-102,186r[2] (1915--0621) (NB)",
        "pt-number": " 3·20107",
        "pt-page": "59[2]",
        "tlp-number": "3·24 (4)",
        "cross-references": "21.6.15 (11)+22.6.15 (14)+",
        "ger": "Offenbar garantiert schon der Umstand der es möglich macht daß gewisse Formen durch eine Definition in einen Namen projiziert werden; dafür daß dieser Name dann auch wie ein wirklicher behandelt werden kann. ",
        "eng": "Obviously the circumstance that makes it possible for certain forms to be projected by means of a definition into a name guarantees of itself that this name can then also be treated like a real one."
    },
    {
        "manuscript": "Ms-102,187r[1] (1915--0621) (NB)",
        "pt-number": "3·20106",
        "pt-page": "58[9]",
        "tlp-number": "3·24 (3)*",
        "cross-references": "21.6.15 (7,12)**",
        "ger": "Es ist ja dem klar Sehenden offenbar daß ein Satz wie „Die Uhr liegt auf dem Tisch” eine Menge Unbestimmtheit enthält trotzdem seine Form äußerlich vollkommen klar und einfach erscheint. Wir sehen also daß diese Einfachheit nur konstruiert ist. ",
        "eng": "To anyone that sees clearly, it is obvious that a proposition like \"The watch is lying on the table\" contains a multitude of indeterminateness in spite of its form outwardly appearing to be perfectly clear and simple. So we see that this simplicity is only a construal."
    },
    {
        "manuscript": "Ms-102,187r[3] et 188r[1] (1915--0622) (NB)",
        "pt-number": " 3·201412",
        "pt-page": "95[4]",
        "tlp-number": "4·002 (5)** ",
        "cross-references": "22.6.15 (2)**",
        "ger": "Die Abmachungen unserer Sprache sind außerordentlich kompliziert. Es wird enorm viel zu jedem Satz dazugedacht was  / nicht gesagt wird. (Diese Abmachungen sind ganz wie die „Conventions” Whiteheads. Sie sind wohl Definitionen mit einer gewissen Allgemeinheit der Form.) ",
        "eng": "The conventions of our language are extraordinarily complicated. There is a great deal added in thought to each proposition that is not said. (These arrangements are quite like Whitehead's \"Conventions\". They are surely definitions with a certain generality of form)."
    },
    {
        "manuscript": "Ms-102,189v[2] (1915--0622) (NB)",
        "pt-number": "3·20107",
        "pt-page": "59[2]",
        "tlp-number": "3·24 (4)",
        "cross-references": "21.6.15 (11)+22.6.15 (14)+",
        "ger": " /\tDer Name faßt seine ganze komplexe Bedeutung in Eins zusammen. ",
        "eng": "The name condenses its whole complex meaning into one."
    },
    {
        "manuscript": "Ms-103,1r[1] (1916--040? --0415?) (NB)",
        "pt-number": "5·412",
        "pt-page": "81[4]",
        "tlp-number": "5·556 b 1",
        "cross-references": "15.4.16 (1)",
        "date": "15.4.16.",
        "ger": "Nur was wir selbst konstruieren, können wir voraussehen! ",
        "eng": "We can anticipate only what we ourselves construct. [See 5.556.]"
    },
    {
        "manuscript": "Ms-103,1r[5] (1916--0415) (NB)",
        "pt-number": "5·3032",
        "pt-page": "55[7]",
        "tlp-number": "5·47 (3)",
        "cross-references": "15.4.16 (5)+   ???",
        "ger": " /\tDenn das einzige Zeichen welches für seine Bedeutung bürgt ist Funktion und Argument. "
    },
    {
        "manuscript": "Ms-103,2r[2] (1916--0416) (NB)",
        "pt-number": "4·43012",
        "pt-page": "78[11]",
        "tlp-number": "4·5 (3a) ",
        "cross-references": "16.4.16 (1)+   21.11.16 (1)+   ???",
        "ger": "Jeder einfache Satz läßt sich auf die Form φx bringen. "
    },
    {
        "manuscript": "Ms-103,2r[2] (1916--0416) (NB)",
        "pt-number": "4·43012",
        "pt-page": "78[11]",
        "tlp-number": "4·5 (3a) ",
        "cross-references": "16.4.16 (1)+   21.11.16 (1)+   ???",
        "ger": "Jeder einfache Satz läßt sich auf die Form φx bringen. "
    },
    {
        "manuscript": "Ms-103,2r[4] (1916--0416) (NB)",
        "pt-number": "4·43013",
        "pt-page": "81[5]",
        "tlp-number": "4·51* ",
        "cross-references": "16.4.16 (3)",
        "ger": " / \\\tAngenommen mir wären alle einfachen Sätze gegeben: Dann läßt sich einfach fragen welche Sätze kann ich aus ihnen bilden. Und das sind alle Sätze und so sind sie begrenzt. ",
        "eng": "Suppose I was given all simple propositions. Then I can simply ask what propositions I can construct out of them. And these are all the propositions and this is how they are delimited. [See 4.51.]"
    },
    {
        "manuscript": "Ms-103,4r[1] (1916--0423) (NB)",
        "pt-number": " 5·00161",
        "pt-page": "102[5]",
        "tlp-number": "5·251* ",
        "cross-references": "23.4.16+  ???",
        "date": "23.4.16.",
        "ger": "Die obige Definition handelt aber gar nicht von allen Sätzen denn sie enthält wesentlich wirkliche Variable. Sie ist ganz analog einer Operation als deren Basis auch ihr eigenes Resultat genommen werden kann. "
    },
    {
        "manuscript": "Ms-103,4r[2] (1916--0426) (NB)",
        "pt-number": "5·00162",
        "pt-page": "81[6]",
        "tlp-number": "5·252 a+ ",
        "cross-references": "26.4.16 (1,2)**   17.8.16(1)+",
        "date": " / \\\t26.4.16.",
        "ger": "So und nur so ist das Fortschreiten von einer Type zur anderen möglich. ",
        "eng": "In this way, and only in this way, is advancing from one type to another possible. [Cf. 5.252.]"
    },
    {
        "manuscript": "Ms-103,4r[3] (1916--0426) (NB)",
        "pt-number": "5·00162",
        "pt-page": "81[6]",
        "tlp-number": "5·252 a+ ",
        "cross-references": "26.4.16 (1,2)**   17.8.16(1)+  ???",
        "ger": " / \\\tUnd man kann sagen alle Typen stehen in Hierarchien. ",
        "eng": "And one can say all types belong to hierarchies."
    },
    {
        "manuscript": "Ms-103,5r[2] (1916--0426) (NB)",
        "pt-number": "5·413",
        "pt-page": "81[7]",
        "tlp-number": "5·5561 ",
        "cross-references": "26.4.16 (4,5,6)**",
        "ger": "Die Grenze zeigt sich wieder in der Gesamtheit der einfachen Sätze. ",
        "eng": "Here too, the limit shows itself in the totality of simple propositions. [See 5.5561.]"
    },
    {
        "manuscript": "Ms-103,5r[3] (1916--0426) (NB)",
        "pt-number": "5·413",
        "pt-page": "81[7]",
        "tlp-number": "5·5561 ",
        "cross-references": "26.4.16 (4,5,6)**",
        "ger": "     Die Bedeutungen ihrer Glieder werden erst durch Zuordnung der Gegenstände zu den Namen bestimmt. ",
        "eng": "     The meanings of their terms are only determined by correlating objects and names."
    },
    {
        "manuscript": "Ms-103,6r[5] et 7r[1] (1916--0506) (NB)",
        "pt-number": "6·371",
        "pt-page": "81[8]",
        "tlp-number": "6·371 ",
        "cross-references": "6.5.16 (1)*",
        "date": " / \\\t6.5.16. ",
        "ger": "/ Der ganzen Weltanschauung der Modernen liegt diese Täuschung zu Grunde, daß die sogenannten Naturgesetze die Erklärungen der Naturerscheinungen seien.",
        "eng": "The whole modern world view is based on the illusion that the so-called laws of nature explain natural phenomena. [See 6.371.]"
    },
    {
        "manuscript": "Ms-103,7r[2] (1916--0506) (NB)",
        "pt-number": "6·372",
        "pt-page": "82[1]",
        "tlp-number": "6·372 ",
        "cross-references": "6.5.16 (2,3)*",
        "ger": " / \\\tSo bleiben sie bei den Naturgesetzen als bei etwas Unantastbarem stehen wie die Älteren bei Gott und dem Schicksal. ",
        "eng": "So moderns stop at the laws of nature, treating them as sacrosanct, which is how the ancients treated God and Fate. [See 6.372.]"
    },
    {
        "manuscript": "Ms-103,7r[3] (1916--0506) (NB)",
        "pt-number": "6·372",
        "pt-page": "82[1]",
        "tlp-number": "6·372 ",
        "cross-references": "6.5.16 (2,3)*",
        "ger": " / \\\tUnd sie haben ja beide recht und unrecht. Die Alten sind allerdings insofern klarer als sie einen klaren Abschluß anerkannten während es bei dem neuen System scheinen soll als sei alles begründet. ",
        "eng": "And actually they are both right, and both wrong.  But the ancients were more clear-sighted in that they recognised a distinct terminus, whereas according to the new dispensation things are supposed to look as if everything were explained. [See 6.372.]"
    },
    {
        "manuscript": "Ms-103,8r[7] et 9r[1] et 10r[1] (1916--0525? --0611?) (NB)",
        "date": "11.6.16.",
        "ger": "Nur so kann ich mich unabhängig von der Welt machen – und sie also doch in gewissem Sinne beherrschen – indem ich auf einen Einfluß auf die Geschehnisse verzichte. ",
        "pt-number": "6·5211",
        "pt-page": "83[3]",
        "tlp-number": "6·521 (2)* ",
        "cross-references": "(11.6.16 (10)+)   7.7.16 (1)  ???",
        "eng": "That life is the world. [Cf. 5.621.]"
    },
    {
        "manuscript": "Ms-103,8r[7] et 9r[1] et 10r[1] (1916--0525? --0611?) (NB)",
        "date": "11.6.16.",
        "ger": "Nur so kann ich mich unabhängig von der Welt machen – und sie also doch in gewissem Sinne beherrschen – indem ich auf einen Einfluß auf die Geschehnisse verzichte. ",
        "pt-number": "6·5211",
        "pt-page": "83[3]",
        "tlp-number": "6·521 (2)* ",
        "cross-references": "(11.6.16 (10)+)   7.7.16 (1)  ???",
        "eng": "That life is the world. [Cf. 5.621.]"
    },
    {
        "manuscript": "Ms-103,8r[7] et 9r[1] et 10r[1] (1916--0525? --0611?) (NB)",
        "date": "11.6.16.",
        "ger": "Nur so kann ich mich unabhängig von der Welt machen – und sie also doch in gewissem Sinne beherrschen – indem ich auf einen Einfluß auf die Geschehnisse verzichte. ",
        "pt-number": "6·5211",
        "pt-page": "83[3]",
        "tlp-number": "6·521 (2)* ",
        "cross-references": "(11.6.16 (10)+)   7.7.16 (1)  ???",
        "eng": "That life is the world. [Cf. 5.621.]"
    },
    {
        "manuscript": "Ms-103,11r[1] (1916--0705) (NB)",
        "pt-number": "6·374",
        "pt-page": "82[3]",
        "tlp-number": "6·374* ",
        "cross-references": "5.7.16 (2)*",
        "date": " / \\\t5.7.16.",
        "ger": "Die Welt ist unabhängig von meinem Willen. ",
        "eng": "The world is independent of my will. [6.373.]"
    },
    {
        "manuscript": "Ms-103,11r[2] (1916--0705) (NB)",
        "pt-number": "6·374",
        "pt-page": "82[3]",
        "tlp-number": "6·374* ",
        "cross-references": "5.7.16 (2)*",
        "ger": " / \\\tAuch wenn alles was wir wünschen geschähe so wäre dies doch nur sozusagen eine Gnade des Schicksals denn es ist kein logischer Zusammenhang zwischen Willen und Welt der dies verbürgte und den angenommenen physikalischen konnten wir doch nicht wieder wollen. "
    },
    {
        "manuscript": "Ms-103,11r[3] et 12r[1] (1916--0705) (NB)",
        "pt-number": "6·44",
        "pt-page": "82[4]",
        "tlp-number": "6·43 (1)** ",
        "cross-references": "5.7.16 (3)**",
        "ger": " / \\\tWenn das gute oder böse Wollen eine Wirkung auf die Welt hat so kann es sie nur auf die Grenzen der Welt haben, / nicht auf die Tatsachen, auf das was durch die Sprache nicht abgebildet sondern nur in der Sprache gezeigt werden kann. "
    },
    {
        "manuscript": "Ms-103,12r[2] (1916--0705) (NB)",
        "pt-number": "6·441",
        "pt-page": "82[5]",
        "tlp-number": "6·43 (2) ",
        "cross-references": "5.7.16 (4,5)",
        "ger": " / \\\tKurz die Welt muß dann dadurch überhaupt eine andere werden. "
    },
    {
        "manuscript": "Ms-103,12r[3] (1916--0705) (NB)",
        "pt-number": "6·441",
        "pt-page": "82[5]",
        "tlp-number": "6·43 (2) ",
        "cross-references": "5.7.16 (4,5)",
        "ger": " / \\\tSie muß sozusagen als Ganzes zunehmen oder abnehmen. Wie durch Dazukommen oder Wegfallen eines Sinnes. "
    },
    {
        "manuscript": "Ms-103,12r[4] (1916--0705) (NB)",
        "pt-number": "6·442",
        "pt-page": "83[1]",
        "tlp-number": "6·431 ",
        "cross-references": "5.7.16 (6)*",
        "ger": " / \\\tWie auch beim Tode die Welt sich nicht ändert, sondern aufhört zu sein. "
    },
    {
        "manuscript": "Ms-103,13r[3] (1916--0706) (NB)",
        "pt-number": "6·521",
        "pt-page": "83[2]",
        "tlp-number": "6·521 (1) ",
        "cross-references": "6.7.16 (3)"
    },
    {
        "manuscript": "Ms-103,13r[4] et 14r[1] (1916--0706) (NB)",
        "pt-number": " 6·4422",
        "pt-page": "83[5]",
        "tlp-number": "6·4311 (2) ",
        "cross-references": "6.7.16 (4)+   8.7.16 (16)",
        "ger": "Kann man aber so leben daß das Leben aufhört problematisch zu sein? Daß / man im Ewigen lebt und nicht in der Zeit? "
    },
    {
        "manuscript": "Ms-103,14r[2] (1916--0707) (NB)",
        "pt-number": "6·5211",
        "pt-page": "83[3]",
        "tlp-number": "6·521 (2)* ",
        "cross-references": "(11.6.16 (10)+)   7.7.16 (1)",
        "date": " / \\\t7.7.16.",
        "ger": "Ist nicht dies der Grund warum Menschen denen der Sinn des Lebens nach langen Zweifeln klar wurde warum diese dann nicht sagen konnten worin dieser Sinn bestand. "
    },
    {
        "manuscript": "Ms-103,15r[4] (1916--0708) (NB)",
        "pt-number": " 6·373",
        "pt-page": "82[2]",
        "tlp-number": "6·373 ",
        "cross-references": "5.7.16 (1)   8.7.16 (4)+",
        "ger": "Die Welt ist mir gegeben, d.h. mein Wille tritt an die Welt ganz von außen als an etwas Fertiges heran. "
    },
    {
        "manuscript": "Ms-103,18r[5] (1916--0708) (NB)",
        "pt-number": "6·4421",
        "pt-page": "83[4]",
        "tlp-number": "6·4311 (la) ",
        "cross-references": "8.7.16 (15)",
        "ger": " / \\\tDer Tod ist kein Ereignis des Lebens. Er ist keine Tatsache der Welt. "
    },
    {
        "manuscript": "Ms-103,18r[6] et 19r[1] (1916--0708) (NB)",
        "pt-number": "6·4422",
        "pt-page": "83[5]",
        "tlp-number": "6·4311 (2) ",
        "cross-references": "6.7.16 (4)+   8.7.16 (16)",
        "ger": " / \\\tWenn man unter Ewigkeit  / nicht unendliche Zeitdauer sondern Unzeitlichkeit versteht, dann kann man sagen daß der ewig lebt der in der Gegenwart lebt. "
    },
    {
        "manuscript": "Ms-103,22r[4] (1916--0711) (NB)",
        "pt-number": "  5·3202",
        "pt-page": "86[6]",
        "tlp-number": "5·524 (1)*",
        "cross-references": "11.7.16 (4,5)**"
    },
    {
        "manuscript": "Ms-103,22r[5] (1916--0711) (NB)",
        "pt-number": "5·3202",
        "pt-page": "86[6]",
        "tlp-number": "5·524 (1)*",
        "cross-references": "11.7.16 (4,5)**",
        "ger": " / \\\tWenn es Gegenstände gibt, gibt es damit auch „alle Gegenstände”. "
    },
    {
        "manuscript": "Ms-103,23r[2] (1916--0711) (NB)",
        "pt-number": "5·3203",
        "pt-page": "83[6]",
        "tlp-number": "5·524 (2) ",
        "cross-references": "11.7.16 (7)",
        "ger": " / \\\tWenn nämlich die Elementarsätze gegeben sind, so sind damit auch alle Elementarsätze gegeben und damit der allgemeine Satz. – Und ist damit nicht schon die Einheit hergestellt. "
    },
    {
        "manuscript": "Ms-103,24r[2] (1916--0713) (NB)",
        "pt-number": "5·503",
        "pt-page": "13.7.16 (4) [Vgl. 83[7]]",
        "tlp-number": "5·503* ",
        "cross-references": "13.7.16 (4) [Vgl. 83[7]]",
        "ger": "Da sich offenbar leicht erklären läßt wie mit diesen Operationen sich Sätze bilden lassen und wie Sätze nicht zu bilden sind so muß sich dies auch irgendwie exakt ausdrücken lassen. "
    },
    {
        "manuscript": "Ms-103,24r[2] (1916--0713) (NB)",
        "pt-number": "5·503",
        "pt-page": "13.7.16 (4) [Vgl. 83[7]]",
        "tlp-number": "5·503* ",
        "cross-references": "13.7.16 (4) [Vgl. 83[7]]",
        "ger": "Da sich offenbar leicht erklären läßt wie mit diesen Operationen sich Sätze bilden lassen und wie Sätze nicht zu bilden sind so muß sich dies auch irgendwie exakt ausdrücken lassen. "
    },
    {
        "manuscript": "Ms-103,30r[1] (1916--0724) (NB)",
        "pt-number": "5·33531",
        "pt-page": "83[8]",
        "tlp-number": "5·621 ",
        "cross-references": "11.6.16 (6)+   24.7.16 (1)",
        "date": " / \\\t24.7.16.",
        "ger": "Die Welt und das Leben sind Eins. "
    },
    {
        "manuscript": "Ms-103,30r[3] (1916--0724) (NB)",
        "pt-number": "6·422",
        "pt-page": "83[11]",
        "tlp-number": "6·421 (2)",
        "cross-references": "24.7.16 (3)+    30.7.16 (9)**",
        "ger": " / \\\tDie Ethik handelt nicht von der Welt. Die Ethik muß eine Bedingung der Welt sein wie die Logik. "
    },
    {
        "manuscript": "Ms-103,30r[4] (1916--0724) (NB)",
        "pt-number": "6·4221",
        "pt-page": "83[9]",
        "tlp-number": "6·421 (3)* ",
        "cross-references": "24.7.16 (4)",
        "ger": " / \\\tEthik und Ästhetik sind Eins. "
    },
    {
        "manuscript": "Ms-103,30r[5] et 31r[1] (1916--0729) (NB)",
        "pt-number": "6·4411",
        "pt-page": "83[12]",
        "tlp-number": "6·43 (3)",
        "cross-references": "29.7.16 (1, 13)",
        "date": " / \\\t29.7.16.",
        "ger": "Denn daß der Wunsch mit seiner Erfüllung in keinem logischen Zusammenhang steht ist eine logische Tatsache. Und daß die Welt des Glücklichen  / eine andere ist als die Welt des Unglücklichen ist auch klar. "
    },
    {
        "manuscript": "Ms-103,34r[1] et 35r[1] (1916--0730) (NB)",
        "pt-number": "6·4412",
        "pt-page": "84[1]",
        "tlp-number": "6·422",
        "cross-references": "30.7.16 (1,2,3)*",
        "date": "/ \\\t30.7.16.",
        "ger": "     Und das ist auch klar daß der Lohn etwas Angenehmes die Strafe etwas Unangenehmes sein muß. "
    },
    {
        "manuscript": "Ms-103,36r[1] (1916--0730) (NB)",
        "pt-number": "6·421",
        "pt-page": "83[10]",
        "tlp-number": "6·421 (1)",
        "cross-references": "30.7.16 (5)",
        "ger": " / \\\tAlles dies ist eigentlich in gewissem Sinne tief geheimnisvoll! Es ist klar daß sich die Ethik nicht aussprechen läßt! "
    },
    {
        "manuscript": "Ms-103,37r[2] (1916--0730) (NB)",
        "pt-number": "6·422",
        "pt-page": "83[11]",
        "tlp-number": "6·421 (2)",
        "cross-references": "24.7.16 (3)+    30.7.16 (9)**",
        "ger": " / \\\tDie Ethik ist transzendent. "
    },
    {
        "manuscript": "Ms-103,39r[1] (1916--0802) (NB)",
        "pt-number": "5·33542",
        "pt-page": "84[3]",
        "tlp-number": "5·632",
        "cross-references": "2.8.16 (7)",
        "ger": " / \\\tGut und Böse tritt erst durch das Subjekt ein. Und das Subjekt gehört nicht zur Welt sondern ist eine Grenze der Welt. "
    },
    {
        "manuscript": "Ms-103,41r[2] (1916--0804) (NB)",
        "pt-number": "5·33543",
        "pt-page": "84[4]",
        "tlp-number": "5·633*",
        "cross-references": "4.8.16 (2,3,4)*",
        "ger": " / \\\tWo in der Welt ist ein metaphysisches Subjekt zu merken? "
    },
    {
        "manuscript": "Ms-103,41r[3] (1916--0804) (NB)",
        "pt-number": "5·33543",
        "pt-page": "84[4]",
        "tlp-number": "5·633*",
        "cross-references": "4.8.16 (2,3,4)*",
        "ger": "     Und ich glaube daß nichts am Gesichtsfeld darauf schließen läßt daß es von einem Auge gesehen wird. "
    },
    {
        "manuscript": "Ms-103,41r[4] (1916--0805) (NB)",
        "pt-number": " 5·3354",
        "pt-page": "60[3]",
        "tlp-number": "5·631 (1)",
        "cross-references": "5.8.16 (1)+20.10.16 (4)+",
        "date": "5.8.16.",
        "ger": "Das vorstellende Subjekt ist wohl leerer Wahn. Das wollende Subjekt aber gibt es. "
    },
    {
        "manuscript": "Ms-103,43r[2] (1916--0812) (NB)",
        "pt-number": "5·33551",
        "pt-page": "85[1]",
        "tlp-number": "5·641 (1-2)",
        "cross-references": "11.8.16 (2)**   12.8.16 (1)*",
        "date": " / \\\t12.8.16.",
        "ger": "Das Ich tritt in die Philosophie dadurch ein, daß die Welt meine Welt ist. "
    },
    {
        "manuscript": "Ms-103,43r[3] (1916--0812) (NB)",
        "pt-number": "5·335431",
        "pt-page": "84[5]",
        "tlp-number": "5·6331**",
        "cross-references": "12.8.16 (2)",
        "ger": " / \\\tDas Gesichtsfeld hat nämlich nicht etwa eine solche Form: "
    },
    {
        "manuscript": "Ms-103,43r[4] et 44r[1] (1916--0812) (NB)",
        "pt-number": "5·33544a",
        "pt-page": "85[2]",
        "tlp-number": "5·634 (1)",
        "cross-references": "12.8.16 (3)*",
        "ger": " / \\\tDas hängt damit zusammen daß kein Teil unserer Erfahrung  / a priori ist. "
    },
    {
        "manuscript": "Ms-103,44r[2] (1916--0812) (NB)",
        "pt-number": "5·33545",
        "pt-page": "85[3]",
        "tlp-number": "5·634 (2-3)",
        "cross-references": "12.8.16 (4,5)",
        "ger": "     Alles was wir überhaupt beschreiben können, könnte auch anders sein. "
    },
    {
        "manuscript": "Ms-103,46r[1] et 47r[1] (1916--0816) (NB)",
        "date": " ⁎\t16.8.16.",
        "ger": "     Fragen wir z.B. warum so taucht sofort der Gedanke auf: Nun wir würden eben Teilchen die sich an zwei Orten befänden verschiedene nennen, und das scheint alles wieder aus der Struktur des Raumes und der Teilchen zu folgen. ",
        "pt-number": "6·3751",
        "pt-page": "88[1]",
        "tlp-number": "6·3751 (1-2)**",
        "cross-references": "16.8.16 (3,4)**"
    },
    {
        "manuscript": "Ms-103,47r[2] (1916--0817) (NB)",
        "pt-number": "5·00162",
        "pt-page": "81[6]",
        "tlp-number": "5·252 a+ ",
        "cross-references": "26.4.16 (1,2)**   17.8.16(1)+",
        "date": " / \\\t17.8.16.",
        "ger": "Operation ist der Übergang von einem Glied zum folgenden einer Formen-Reihe. "
    },
    {
        "manuscript": "Ms-103,47r[3] (1916--0817) (NB)",
        "pt-number": "5·005341",
        "pt-page": "93[3]",
        "tlp-number": "5·232* ",
        "cross-references": "17.8.16 (1)+",
        "ger": " / \\\tOperation und Formen-Reihe sind Äquivalente. "
    },
    {
        "manuscript": "Ms-103,47r[4] et 48r[1] (1916--0819? --0829?) (NB)",
        "pt-number": " 5·3071",
        "pt-page": "80[4]",
        "tlp-number": "5·474 ",
        "cross-references": "29.8.16 (1)+",
        "date": "/ 29.8.16.",
        "ger": "Die Frage ist, ob die gewöhnliche kleine Anzahl von Grundoperationen genügt um alle möglichen Operationen herzustellen. "
    },
    {
        "manuscript": "Ms-103,48r[4] (1916--0902) (NB)",
        "pt-number": "5·3355",
        "pt-page": "85[4]",
        "tlp-number": "5·64",
        "cross-references": "2.9.16 (1,2)   15.10.16 (21)+",
        "date": " / \\\t2.9.16.",
        "ger": "Hier sieht man daß der Solipsismus streng durchgeführt mit dem reinen Realismus zusammenfällt. "
    },
    {
        "manuscript": "Ms-103,49r[1] (1916--0902) (NB)",
        "pt-number": "5·3355",
        "pt-page": "85[4]",
        "tlp-number": "5·64",
        "cross-references": "2.9.16 (1,2)   15.10.16 (21)+",
        "ger": " / \\\tDas Ich des Solipsismus schrumpft zum ausdehnungslosen Punkt zusammen und es bleibt die ihm koordinierte Realität bestehen. "
    },
    {
        "manuscript": "Ms-103,50r[3] et 51r[1] (1916--0902) (NB)",
        "pt-number": "5·33552",
        "pt-page": "94[5]",
        "tlp-number": "5·641 (3)* ",
        "cross-references": "2.9.16 (7)*",
        "ger": " /\tDas philosophische Ich ist nicht der Mensch, nicht der menschliche Körper oder die menschliche Seele mit den psychologischen Eigenschaften, sondern das metaphysische Subjekt die Grenze (nicht ein Teil) der Welt. Der menschliche Körper aber, mein Körper insbesondere ist ein Teil der Welt  / unter anderen Teilen der Welt unter Tieren, Pflanzen, Steinen etc. etc. "
    },
    {
        "manuscript": "Ms-103,52r[2] (1916--0911) (NB)",
        "pt-number": "4·1022331",
        "pt-page": "95[3]",
        "tlp-number": "4·123 (1-2)",
        "cross-references": "11.9.16 (2)+   MN 222 (7)**",
        "ger": "Daß die Farben keine Eigenschaften sind, zeigt die Analyse der Physik, zeigen die internen Relationen in welchen die Physik die Farben zeigt. "
    },
    {
        "manuscript": "Ms-103,53r[2] (1916--0919) (NB)",
        "pt-number": "5·30225",
        "pt-page": "76[3]",
        "tlp-number": "5·4541 (2-3)* ",
        "cross-references": "5.3.15 (1)  19.9.16 (1)+",
        "date": " / \\\t19.9.16.",
        "ger": "Die Menschheit hat immer nach einer Wissenschaft gesucht in welcher simplex sigillum veri ist."
    },
    {
        "manuscript": "Ms-103,54r[4] (1916--1007) (NB)",
        "pt-number": " 6·431",
        "pt-page": "85[6]",
        "tlp-number": "6·45 (1)*",
        "cross-references": "7.10.16 (2,3)+",
        "date": "7.10.16.",
        "ger": "Das Kunstwerk ist der Gegenstand sub specie aeternitatis gesehen; und das gute Leben ist die Welt sub specie aeternitatis gesehen. Dies ist der Zusammenhang zwischen Kunst und Ethik."
    },
    {
        "manuscript": "Ms-103,55r[1] (1916--1007) (NB)",
        "pt-number": "6·431",
        "pt-page": "85[6]",
        "tlp-number": "6·45 (1)*",
        "cross-references": "7.10.16 (2,3)+",
        "ger": " / \\\tDie gewöhnliche Betrachtungsweise sieht die Gegenstände gleichsam aus ihrer Mitte, die Betrachtung sub specie aeternitatis von außerhalb."
    },
    {
        "manuscript": "Ms-103,55r[5] (1916--1007) (NB)",
        "pt-number": " 6·431",
        "pt-page": "85[6]",
        "tlp-number": "6·45 (1)*",
        "cross-references": "7.10.16 (2,3)+",
        "ger": "(Es drängt sich der Gedanke auf): Das Ding sub specie aeternitatis gesehen ist das Ding mit dem ganzen logischen Raum gesehen. "
    },
    {
        "manuscript": "Ms-103,59r[2] (1916--1012) (NB)",
        "pt-number": "5·33532",
        "pt-page": "85[5]",
        "tlp-number": "5·63*",
        "cross-references": "12.10.16 (7,8)**",
        "ger": " / \\\tEs ist wahr: der Mensch ist der Mikrokosmos: "
    },
    {
        "manuscript": "Ms-103,59r[3] (1916--1015) (NB)",
        "pt-number": " 5·40421",
        "pt-page": "90[3]",
        "tlp-number": "5·61 (4)",
        "cross-references": "15.10.16 (1)+",
        "date": "15.10.16.",
        "ger": "     Was man sich nicht denken kann, darüber kann man auch nicht reden. "
    },
    {
        "manuscript": "Ms-103,61r[2] (1916--1015) (NB)",
        "pt-number": " 5·0441",
        "pt-page": "16[5]",
        "tlp-number": "5·136",
        "cross-references": "15.10.16 (10)+",
        "ger": "Aber es ist klar daß der Kausalnexus gar kein Nexus ist. "
    },
    {
        "manuscript": "Ms-103,64r[2] (1916--1015) (NB)",
        "pt-number": "5·3355",
        "pt-page": "85[4]",
        "tlp-number": "5·64",
        "cross-references": "2.9.16 (1,2)   15.10.16 (21)+",
        "ger": "Der Idealismus scheidet aus der Welt als unik die Menschen aus, der Solipsismus scheidet mich allein aus, und endlich sehe ich daß auch ich zur übrigen Welt gehöre auf der einen Seite bleibt also nichts übrig auf der anderen als unik die Welt. So führt der Idealismus streng durchdacht zum Realismus. "
    },
    {
        "manuscript": "Ms-103,66r[3] (1916--1020) (NB)",
        "pt-number": "5·3354",
        "pt-page": "60[3]",
        "tlp-number": "5·631 (1)",
        "cross-references": "5.8.16 (1)+20.10.16 (4)+",
        "ger": "Es ist wahr daß das erkennende Subjekt nicht in der Welt ist, daß es kein erkennendes Subjekt gibt. "
    },
    {
        "manuscript": "Ms-103,79r[6] et 80r[1] (1916--1121) (NB)",
        "pt-number": "4·43012",
        "pt-page": "78[11]",
        "tlp-number": "4·5 (3a) ",
        "cross-references": "16.4.16 (1)+   21.11.16 (1)+",
        "date": "21.11.16.",
        "ger": "Daß es möglich ist die allgemeine Satzform aufzustellen sagt nichts anderes als: Jede mögliche Satzform  / muß sich voraussehen lassen. "
    },
    {
        "manuscript": "Ms-103,79r[6] et 80r[1] (1916--1121) (NB)",
        "pt-number": "4·43012",
        "pt-page": "78[11]",
        "tlp-number": "4·5 (3a) ",
        "cross-references": "16.4.16 (1)+   21.11.16 (1)+",
        "date": "21.11.16.",
        "ger": "Daß es möglich ist die allgemeine Satzform aufzustellen sagt nichts anderes als: Jede mögliche Satzform  / muß sich voraussehen lassen. "
    },
    {
        "manuscript": "Ms-103,83r[3] (1916--1121) (NB)",
        "pt-page": " 118[5] ",
        "tlp-number": "             5·2523+",
        "cross-references": "21.11.16 (12)*",
        "ger": "Der Begriff „und so weiter” ist äquivalent mit dem Begriffe der Operation. "
    },
    {
        "manuscript": "Ms-103,87r[2] (1916--1127? --1128?) (NB)",
        "pt-number": " 1·21",
        "pt-page": "78[10]",
        "tlp-number": "1·21",
        "cross-references": "28.11.16+",
        "date": "28.11.16.",
        "ger": "Entweder eine Tatsache ist in einer anderen enthalten, oder sie ist unabhängig von ihr. "
    },
    {
        "manuscript": "Ms-103,87r[3] (1916--1202) (NB)",
        "pt-number": "     5·322",
        "pt-page": "63[5]",
        "tlp-number": "3.11.14 (12)** 2.12.16 (1)+  (Pilch: 5·3221)",
        "cross-references": "3.11.14 (12)** 2.12.16 (1)+  (Pilch: 5·3221)",
        "date": "2.12.16.",
        "ger": "Die Ähnlichkeit der Allgemeinheitsbezeichnung mit dem Argument zeigt sich wenn wir statt φa schreiben (ax).φx. "
    },
    {
        "manuscript": "Ms-103,88r[2] (1916--1202) (NB)",
        "pt-number": "6·53",
        "pt-page": "85[7]",
        "tlp-number": "6·53 a",
        "cross-references": "2.12.16 (3)*",
        "ger": " / \\\tDie richtige Methode in der Philosophie wäre eigentlich die nichts zu sagen als was sich sagen läßt also Naturwissenschaftliches also etwas was mit Philosophie nichts zu tun hat. Und dann immer wenn ein anderer etwas Metaphysisches sagen wollte ihm nachweisen daß er gewissen Zeichen in seinen Sätzen keine Bedeutung gegeben hat. "
    },
    {
        "manuscript": "Ms-103,88r[3] et 89r[1] (1916--1202) (NB)",
        "pt-number": "6·531",
        "pt-page": "86[1]",
        "tlp-number": "6·53 b*",
        "cross-references": "2.12.16 (4)*",
        "ger": " / \\\tDiese Methode wäre für  / den anderen unbefriedigend (er hätte nicht das Gefühl daß wir ihn Philosophie lehrten) aber sie wäre die einzig richtige. "
    },
    {
        "manuscript": "Ms-103,90r[3] (1917--0108) (NB)",
        "pt-number": " 6·3752",
        "pt-page": "94[6]",
        "tlp-number": "6·3751 (3)** ",
        "cross-references": "8.1.17 (1,2)**",
        "date": "8.1.17.",
        "ger": "Es ist klar daß das logische Produkt zweier Elementarsätze nie eine Tautologie sein kann. "
    }
]